Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/contact.po
Languages: pt_pt, ru, zh_tw

source: Contact Us
pt_pt: Contacte-nos
ru: связаться с нами
zh_tw: 聯絡我們

source: OSGeoLive development is coordinated via email and internet chat (IRC) as detailed on the `OSGeo Wiki <http://wiki.osgeo.org/wiki/OSGeoLive#Contact_Us>`_.
pt_pt: O desenvolvimento do OSGeoLive é coordenado através de email e conversa pela internet (IRC) conforme descrito na `Wiki OSGeo <http://wiki.osgeo.org/wiki/OSGeoLive#Contact_Us>`_.
ru: Разработка Osgeolive координируется через электронную почту и интернет-чат (IRC) какописано в `OSGeo Wiki <http://wiki.osgeo.org/wiki/OSGeoLive#Contact_Us>`_.
zh_tw: OSGeoLive 的開發是經由郵件或是網路聊天 (IRC) 來協調，詳情請見 `OSGeo Wiki <http://wiki.osgeo.org/wiki/OSGeoLive#Contact_Us>`_。

source: Disclaimer
pt_pt: Aviso Legal
ru: Оговорка
zh_tw: 免責聲明

source: This Live GIS disc and virtual-machine has been put together by members of the OSGeo community to showcase their favourite Free and Open Source (FOSS) geospatial software. We've included a number of non-OSGeo software packages, from both the spatial and non-spatial realms, which we hope you will find to be as useful as we do. The OSGeo Foundation does not recommend or guarantee any associated software, projects, or companies found within.
pt_pt: Esta distribuição foi criada por membros da comunidade OSGeo para demonstrar as suas soluções preferidas no domínio geospacial, baseadas em software livre open source (FOSS). São incluídos outros softwares que não são da responsabilidade da OSGeo que podem ser úteis. Contudo, a Fundação OSGeo não recomenda nem dá garantias a nenhum outro software, projeto ou empresa relacionada.
ru: Этот ГИС диск и виртуальная машина разработаны членами сообщества OSGeo в целях демонстрации бесплатного геопространственного программного обеспечения с открытым исходным кодом. Мы также включили ряд пространственных и не пространственных пакетов программного обеспечения, не принадлежащих OSGeo. Мы надеемся, что они будут вам полезны. Фонд OSGeo не рекламирует и не гарантируетникакое програмное обеспечение, проекты или компании.
zh_tw: 這片 Live GIS 磁片和虛擬機器由 OSGeo 社群的成員做成，用來展示他們最喜愛的自由與開源 (FOSS) 地理資訊軟體。我們包進一些非 OSGeo 的軟體套件，有些是空間相關，有些並不是，希望能對你有幫助。OSGeo 基金會並不推薦或是擔保裡頭會找到的相關軟體、計畫或是公司。

source: `These programs are distributed in the hope that they will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.`
pt_pt: `Este programa é distribuído na esperança de que possa ser útil, mas SEM NENHUMA GARANTIA; sem uma garantia implícita de ADEQUAÇÃO a qualquer MERCADO ou APLICAÇÃO EM PARTICULAR.`
ru: Эти программы распространяются в надежде, что они будут полезными в использовании, нобез каких-либо гарантий; даже без подразумеваемых гарантий коммерческой выгодыили пригодности для определенной цели. `
zh_tw: ‘這些軟體的散佈方式希望對大家有用，但不含任何保證書；甚至沒有適銷性或特定用途適用性的暗示保證。‘

source: For additional information on the distribution of each program review their license as indicated on the page for each program.
pt_pt: Para mais informações sobre cada um dos programas, reveja a respetiva licença que aparece na página dedicada a cada programa.
ru: Для получения дополнительной информации о распространении каждой программы, ознакомьтесь с лицензией, указанной на странице каждой программы.
zh_tw: 要找到散佈的軟體額外的資訊，請察看每個軟體頁面的授權條款。

source: Community Support
pt_pt: Suporte da comunidade
ru: Поддержка сообществом
zh_tw: 社群支援

source: If you have any questions, comments, or run into any problems, please drop us a note on `our mailing list <http://lists.osgeo.org/mailman/listinfo/osgeolive>`_.
pt_pt: Se tiver dúvidas, comentários, ou qualquer problema, por favor deixe-nos uma mensagem na `nossa lista de discussão <http://lists.osgeo.org/mailman/listinfo/osgeolive>`_.
ru: Если у вас есть какие-либо вопросы, комментарии или возникли проблемы, пожалуйста, напишитенам на наш `mailing list <http://lists.osgeo.org/mailman/listinfo/osgeolive>`_.
zh_tw: 如果你有任何問題、意見，或是程式出問題，請到`我們的郵件論壇<http://lists.osgeo.org/mailman/listinfo/osgeolive>`_詢問。

source: Searchable archives of the mailing list are hosted by `Nabble <http://osgeo-org.1560.x6.nabble.com/OSGeo-FOSS4G-LiveDVD-f3777350.html>`_.
pt_pt: Os arquivos da lista estão disponíveis e podem ser pesquisados no `Nabble <http://osgeo-org.1560.x6.nabble.com/OSGeo-FOSS4G-LiveDVD-f3777350.html>`_.
ru: Архивы списка рассылки с возможностью поиска размещаются на`Nabble <http://osgeo-org.1560.x6.nabble.com/OSGeo-FOSS4G-LiveDVD-f3777350.html>`_.
zh_tw: 過往在郵件論壇上面的討論，可以到 `Nabble <http://osgeo-org.1560.x6.nabble.com/OSGeo-FOSS4G-LiveDVD-f3777350.html>`_ 尋找。

source: IRC users might try the #osgeolive or #osgeo channel at Freenode.net for real-time assistance. You also can meet us at Slack, Matrix or Glitter.
pt_pt: Os utilizadores do IRC podem experimentar o canal #osgeolive ou #osgeo no Freenode.net para obter assistência em tempo real. Você também pode nos encontrar no Slack, Matrix ou Glitter.
zh_tw: IRC 使用者也許可以嘗試 Freenode.net 的 #osgeolive 或 #osgeo 頻道來取得即時協助，你也可以到 Slack、Matrix 或 Glitter 尋求協助。

source: A wealth of information is available on our `Wiki site <http://wiki.osgeo.org/wiki/OSGeoLive>`_, and a `bug and wish tracking system <https://trac.osgeo.org/osgeolive/report/10>`_ is also available.
pt_pt: Uma grande quantidade de informações está disponível em nosso site `Wiki <http://wiki.osgeo.org/wiki/OSGeoLive>`_, e um `sistema de monitorização de erros e pedidos <https://trac.osgeo.org/osgeolive/report/10>`_ também está disponível.
ru: Огромное количество полезной информации доступно на нашей `Wiki<http://wiki.osgeo.org/wiki/OSGeoLive>`_, а также существует `баг-трекер <https://trac.osgeo.org/osgeolive/report/10>`_ .
zh_tw: ‘Wiki 站 <http://wiki.osgeo.org/wiki/OSGeoLive>`_ 上能找到豐富的資訊，而也有`臭蟲或請求功能系統<https://trac.osgeo.org/osgeolive/report/10>`_ 。

source: Stay tuned and follow OSGeoLive on Twitter `@osgeolive <https:twitter.com/osgeolive>`_.
pt_pt: Fique ligado e siga o OSGeoLive no Twitter `@osgeolive <https:twitter.com/osgeolive>`_.
zh_tw: 保持聯繫然後追隨 Twitter 上的 OSGeoLive `@osgeolive <https:twitter.com/osgeolive>`_。

source: Commercial Support
pt_pt: Suporte comercial
ru: Коммерческая поддержка
zh_tw: 商業支援

source: Most packaged applications have both community and commercial support offerings for them. Refer to specific application descriptions linked from the :doc:`Contents <./overview/overview>` for details.
pt_pt: Muitas das aplicações incluídas têm suporte suportado pela comunidade ou comercial. Reveja as descrições de cada um que aparecem em :doc:`Contents <./overview/overview>`.
ru: Большинство приложений имеют как поддержку сообщества, так и коммерческую поддержку.Вы можете ознакомиться с описаниями приложений здесь: :doc:`Contents <./overview/overview>`
zh_tw: 大部分的軟體套件都有社群和商業支援。需要特定的軟體描述請到 :doc:`Contents <./overview/overview>` 瞭解詳情。

source: In addition, there are a large number of consultancy firms world wide who provide support for OSGeo member projects. See https://www.osgeo.org/service-providers/ for one that meets your needs.
pt_pt: Além disso, há um grande número de empresas de consultoria em todo o mundo que fornecem suporte para projetos membros da OSGeo. Consulte https://www.osgeo.org/service-providers/ para encontrar um que atenda às suas necessidades.
ru: Кроме того, в мире существует большое число консалтинговых фирм, которыеоказывают поддержку проектов OSGeo. См. https://www.osgeo.org/service-providers/ чтобы найти то, которое отвечает вашим потребностям.
zh_tw: 另外，全球還有為數不少的顧問公司，提供 OSGeo 成員計畫的支援。請參見 https://www.osgeo.org/service-providers/ 來找尋適合你的需求的公司。
