Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/download.po
Languages: pt_pt

source: Download
pt_pt: Transferir

source: The latest stable release is |osgeolive-version| and can be downloaded from:
pt_pt: A última versão estável é |osgeolive-version| e pode ser transferida de:

source: Picking the right image for you:
pt_pt: Escolha a imagem certa para si:

source: **osgeolive iso**: |osgeolive-iso-size|
pt_pt: **osgeolive iso**: |osgeolive-iso-tamanho|

source: A Lubuntu based bootable image, which can be copied to an 8 Gig USB thumb drive (faster and recommended) or DVD (cheaper). It can also be used to build a virtual machine from scratch.
pt_pt: Uma imagem de arranque baseada em Lubuntu, que pode ser copiada para uma unidade USB de 8 GB (mais rápido e recomendado) ou DVD (mais barato). Também pode ser usado para criar uma máquina virtual a partir do zero.

source: **osgeolive-vm**: |osgeolive-vm-7z-size|
pt_pt: **osgeolive-vm**: |osgeolive-vm-7z-tamanho|

source: This is a pre-made virtual machine (.vmdk), based on osgeolive, suitable for use in VirtualBox, VMWare, KVM and other virtual machine applications. It has been compressed using `7-Zip <http://www.7-zip.org/>`_.
pt_pt: Esta é uma máquina virtual pré-fabricada (VMDK), feita com base no osgeolive, apropriada para o uso na VirtualBox, VMWare, KVM e outros programas de máquinas virtuais. Foi comprimido usando 7-Zip < http://www.7-zip.org/ >'_.

source: **amd64 or i386 architecture**
pt_pt: **arquitetura amd64 ou i386**

source: ISO images are available for recent amd64 hardware (recommended) as well as older i386 hardware.
pt_pt: Estão disponíveis imagens ISO para o hardware amd64 recente (recomendado), tal como para hardware i386 mais antigo.

source: You can use the md5 checksum to verify the image downloaded successfully.
pt_pt: Pode usar o md5 checksum para verificar se a imagem transferida foi concluída com sucesso.

source: **System Requirements**
pt_pt: **Requisitos do Sistema**

source: `Minimum suggested system resources: 1 GB RAM (2 GB are better for trying Java based applications), 1GHz i386 or amd64 compatible CPU. No hard drive required. Mac users will benefit from a 3-button USB mouse.`
pt_pt: 'Recursos de sistema mínimos sugeridos: 1 GB RAM (2 GB são melhores para experimentar aplicações baseadas em Java), 1GHz i386 ou CPU compatível com amd64. Não é necessário disco duro. Os utilizadores de Mac irão beneficiar do uso de um rato USB com 3 botões.'
