Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/index.po
Languages: pl, pt_pt

source: Welcome to |osgeolive-version|
pl: Witaj w |osgeolive-version|
pt_pt: Bem vindo ao |osgeolive-version|

source: `OSGeoLive <http://live.osgeo.org>`_ is a self-contained bootable DVD, USB thumb drive or Virtual Machine based on `Lubuntu <http://lubuntu.net>`_, that allows you to try a wide variety of open source geospatial software without installing anything. It is composed entirely of free software, allowing it to be freely distributed, duplicated and passed around.
pl: `OSGeoLive <http://live.osgeo.org>`_ jest to startowe DVD, PenDrive USB lub wirtualna maszyna z systemem `Lubuntu <http://lubuntu.net>`_. Pozwala na wypróbowanie szerokiego wachlarza oprogramowania open source do zastosowań geoprzestrzennych, bez konieczności ich instalowania. Na płycie znajduje się wyłącznie oprogramowanie opatrzone wolnymi licencjami, uprawniającymi do powielania i rozpowszechniania go.
pt_pt: A `OSGeoLive <http://live.osgeo.org>`_ é uma distribuição autónoma baseada no `Lubuntu <http://lubuntu.net>`_, que pode arracancar a partir de DVD, USB ou como uma máquina virtual. Permite experimentar uma grande variedade de software geoespacial open source sem ter que instalar cada um deles. Só contém software livre. Pode ser livremente duplicada e distribuída.

source: It provides pre-configured applications for a range of geospatial use cases, including storage, publishing, viewing, analysis and manipulation of data. It also contains sample datasets and documentation.
pl: OSGeo-Live zawiera wstępnie skonfigurowane aplikacje przydatne w wielu zadaniach geoprzestrzennych, takich jak przechowywanie, publikowanie, przeglądanie, analizy i przetwarzanie danych. Płyta zawiera również zestawy danych do ćwiczeń i dokumentację.
pt_pt: Inclui soluções que cobrem uma variedade de necessidades geoespaciais, como armazenamento, publicação, visualização, análise e manipulação de dados. Também inlui dados para teste e documentação.

source: To try out the applications, simply:
pl: Aby wypróbować aplikacje zgromadzone na OSGeo-Live, po prostu:
pt_pt: Para testar as aplicações, simplesmente:

source: Insert DVD or USB thumb drive in computer or virtual machine.
pl: Włóż DVD lub pendrive USB do komputera lub maszyny wirtualnej.
pt_pt: Insira o DVD ou pen USB no computador ou máquina virtual.

source: Reboot computer. (verify boot device order if necessary)
pl: Zrestartuj komputer (ewentualnie sprawdź kolejność bootowania).
pt_pt: Reinicie o computador. (verificar a ordem dos dispositivos de arranque se necessário)

source: Press "Enter" to startup & login.
pl: Naciśnij "Enter" aby się zalogować.
pt_pt: Pressione "Enter" para arranque e login.

source: Select and run applications from the "Geospatial" menu.
pl: Wypróbuj aplikacje znajdujące się w menu “Geospatial”.
pt_pt: Selecione e execute as aplicações no menu "Geospatial".

source: OSGeoLive is an `OSGeo Foundation <http://osgeo.org/>`_ project. The OSGeo Foundation is a not-for-profit supporting Geospatial Open Source Software development, promotion and `education <http://www.geoforall.org/>`_.
pt_pt: A OSGeoLive é um projeto da Fundação `OSGeo <http://osgeo.org/>`_. A OSGeo é uma fundação sem fins lucrativos que apoia o desenvolvimento de software open source no domínio geoespacial, a sua promoção e a `educação <http://www.geoforall.org/>`_.

source: Quick Starts
pl: Szybkie wprowadzenia
pt_pt: Guias

source: Presentation
pl: Prezentacja
pt_pt: Apresentação

source: A half hour `presentation <presentation.html>`_, highlighting all OSGeoLive applications, is available with slides, script, and `abstract <presentation/abstract.txt>`_.
pl: Półgodzinna `prezentacja <presentation.html>`_ omawiająca wszystkie zawarte na OSGeo-Live programy, dostępna jest w postaci slajdów, skryptów i `abstraktów <presentation/abstract.txt>`_.
pt_pt: Uma meia hora de `presentation <presentation.html>`_, destacando todas as aplicações OSGeoLive, está disponível com slides, script e `abstract <presentation/abstract.txt>`_.
