Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/metrics.po
Languages: pt_pt

source: |osgeolive-version| Project Metrics
pt_pt: Métricas do |osgeolive-version|

source: Metrics provided by `OpenHUB <https://www.openhub.net/>`_ which are derived from the projects' code repositories. Note these metrics have known deficiencies (such as caused by repositories moving), and only provide partial indications about the projects' development. Lack of change in smaller, concise packages and libraries may simply reflect a level of maturity and completeness.
pt_pt: As métricas do projeto são fornecidas pelo `OpenHUB <https://www.openhub.net/>`_ a partir dos repositórios do código. Estas estatísticas têm algumas limitações (por exemplo, devido a transferências dos repositórios) e os indicadores podem não refletir fielmente as atividades de desenvolvimento do projeto. A menor atualização em pequenos pacotes ou bibliotecas pode simplesmente ser um indício de que se trata de código estável e maduro.

source: Viewing the metrics requires an Internet connection and Javascript to be enabled.
pt_pt: Para consultar as métricas do projeto é necessário uma ligação à internet e ter o Javascript ativo no browser.

source: Desktop GIS
pt_pt: SIG Desktop

source: Browser Facing GIS
pt_pt: SIG no browser

source: Data Stores
pt_pt: Repositórios de dados

source: Navigation and Maps
pt_pt: Mapas e navegação

source: Spatial Tools
pt_pt: Ferramentas geográficas

source: Domain Specific GIS
pt_pt: SIG para domínios específicos

source: Data
pt_pt: Dados

source: Geospatial Libraries
pt_pt: Bibliotecas Geoespaciais
