Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/actinia_quickstart.po
Languages: hu

source: Actinia Quickstart
hu: Actinia gyorstalpaló

source: Actinia is an open source REST API for scalable, distributed, high performance processing of geographical data that uses GRASS GIS for computational tasks. Actinia provides a REST API to process satellite images, time series of satellite images, raster and vector data.
hu: Az Actinia egy nyílt forráskódú REST API térinformatikai adatok skálázható, megosztott, nagy teljesítményű feldolgozásához, mely GRASS GIS-t használ a számítási feladatokhoz. Az Actiniaegy REST API-t biztosít műholdképek, műholdkép idősorok. raszter és vektor adatok feldolgozásához.

source: Quick tour
hu: Egy gyors túra

source: To run actinia on OSGeoLive, you will send HTTP GET, PUT, POST and DELETE requests to the actinia server.
hu: Az Actinia futtatásához az OSGeoLine-on, HTTP GET, PUT, POST és DELETE kéréseket kell küldenie az Actinia szervernek.

source: Sample query with curl
hu: Minta kérés curl használatával

source: Example: query of actinia version on OSGeoLive actinia server:
hu: Példa: az Actinia verzió lekérdezése az OSGeoLive Actinia szervertől:

source: Data management example
hu: Adatkezelési példa

source: List all locations that are available in the actinia persistent database:
hu: Az összes, az actinia állandó adatbázisában elérhető, helyek listája:

source: List all mapsets in the location LL:
hu: Az összes térképhalmaz listája az LL helyen:

source: List all space-time raster datasets (STRDS) in location LL and mapset Sentinel_timeseries:
hu: Az összes tér-idő taszter adathalmaz (STRDS) listája az LL helyen a Sentinel_timeseries térképhalmazban.

source: List all raster map layers of the STRDS:
hu: Az összes STRDS raszter térkép réteg listája:

source: Landsat and Sentinel-2 NDVI computation example
hu: Landsat és Sentinel-2 NDVI számítási példa

source: Compute the NDVI of the top of athmosphere (TOAR) corrected Landsat4 scene LC80440342016259LGN00:
hu: NDVI számítás a felső atmoszféréra (TOAR) javítással ellátott Landsat4 képre LC80440342016259LGN00:

source: NDVI computation of Sentinel-2A scene S2A_MSIL1C_20170212T104141_N0204_R008_T31TGJ_20170212T104138:
hu: NDVI számítás Sentinel-2A képre S2A_MSIL1C_20170212T104141_N0204_R008_T31TGJ_20170212T104138:

source: The results of the asynchronous computations are available as GeoTIFF file in a cloud storage for download.
hu: Az aszinkron számítás eredményei a letöltéshez mint GeoTIFF fájlok érhetők el a felhőben.

source: Ways to use actinia
hu: actinia felhasználási módok

source: Providing a REST API, actinia can be used in different ways:
hu: Mivel REST API-t biztosít, az actinia-t különböző módokon használhatjuk:

source: `curl` or similar command line tools
hu: curl vagy hasonló parancsori eszköz

source: the `Postman` extension for browsers
hu: a `Postman` bövítmény a böngészőkhöz

source: open a GRASS GIS session and use the `ace` (actinia command execution) tool
hu: GRASS GIS munkafolyamat nyitása és az `ace` (actinia command execution) eszköz használata

source: other interfaces to REST API
hu: más interfész REST API-hoz

source: In this quickstart, we make use of GRASS GIS to conveniently launch commands from the session to the actinia server (which itself uses GRASS GIS). The idea is to rapidly develop a workflow locally on small data sets to then execute it on the server.
hu: Ebben a gyorstalpalóban a GRASS GIS-t használjuk a parancsok indítására a munkamenetből az actinia szerver felé (mely maga is GRASS GIS-t használ). Az elképzelés az, hogy gyorsan dolgozzunk ki egy munkafolyamatot helyben, kis adathalmazzal,majd hajtsuk végre a szerveren.

source: Introduction to ace - actinia command execution
hu: Bevezetés az ac-ba - actinia parancs végrehajtás

source: The ``ace`` tool (`details <https://github.com/mundialis/actinia_core/tree/master/scripts>`_) allows the execution of a single GRASS GIS command or a list of GRASS GIS commands on an actinia REST service (https://actinia.mundialis.de/). In addition it provides job management, the ability to list locations, mapsets and map layer the user has access to as well as the creation and deletion of mapsets.
hu: Az ``ace`` eszköz (részletek <https://github.com/mundialis/actinia_core/tree/master/scripts>`_) lehetővé teszi egy GRASS GIS parancs vagy a GRASS GIS parancsok listájának végrehajtását egy actinia REST szolgáltatáson (https://actinia.mundialis.de/). Továbbá munkakezelést is biztosít, a képesség, hogy a felhasználó által elérhető helyeket, térképhalmazokat, és térkép rétegeket listázzon továbbá térképhalmazokat hozzon létre és töröljön.

source: Th ``ace`` tool must be executed in an active GRASS GIS session and will use the current location of this session to access the actinia service.
hu: Az ``ace`` eszközt egy aktív GRASS GIS munkafolyamatban kell végrehajtani és ennek a munkafolyamatnak az aktuális helyét használja az actinia szolgáltatás eléréséhez.

source: The current location setting can be overridden by the ``--location LOCATION_NAME`` option. All commands will be executed per default in an **ephemeral** database. Hence, generated output must be exported using augmented GRASS commands.
hu: Az aktuális hely beállítás felülbírálható a ``--location LOCATION_NAME`` paraméterrel. Minden parancsot egy **tiszavirág életű** adatbázisban hajtunk végre alapértelmezés szerint. Ezért az elkészített outputot exportálni kell a kibővített GRASS parancsok használatával.

source: The option ``--persistent MAPSET_NAME`` allows the execution of commands in the **persistent** user database. It can be used with ``--location LOCATION_NAME``\ option.
hu: A ``--persistent MAPSET_NAME`` paraméter lehetővé teszi a parancsok végrehajtását az **állandó** felhasználói adatbázisban. Ez használható a ``--location LOCATION_NAME``\ paraméterrel együtt.

source: Requirements and setup
hu: Követelmények és beállítások

source: Needed Python libraries
hu: Szükséges Python könyvtárak

source: In case not yet present on the system, the following Python libraries are needed:
hu: Ha még nincs fent a rendszerén, akkor a következő Python könyvtárak szükségesek:

source: Authentication settings
hu: Hitelesítési beállítások

source: The user must setup the following environmental variables to specify the actinia server and credentials:
hu: A felhasználónak a következő környezeti változókat kell beállítania az actinia szerverhez és a hitelesítő adatokhoz:

source: Notes on the usage of external data sources
hu: Megjegyzés a külső adatforrások használatához

source: GRASS GIS commands can be augmented with actinia specific extensions. The ``+`` operator can be specified for an input parameter to import a web located resource and to specify the export of an output parameter.
hu: A GRASS GIS parancsok kibővíthetők az actinia specifikus kiterjesztésekkel. a ``+`` művelet adható meg egy input vagy output paraméterhez, hogy egy web helyről importálja az erőforrást illetve, hogy exportálja.

source: See *Example 1* and other examples below.
hu: Lásd az *Example 1*-t és a további példákat lent.

source: Available data
hu: Elérhető adatok

source: Importantly, the name of the local location and mapset must correspond to that on the actinia REST server.
hu: Fontos, hogy a lokális hely és térképhalmaz egyezzen meg a actinia REST szerverével.

source: Currently available datasets are (organized by projections):
hu: Aktuálisan elérhető adathalmazok (vetület szerint csoportosítva):

source: North Carolina sample dataset (NC State-Plane metric CRS, EPSG: 3358):
hu: Észak Carolina minta adathalmaz (NC State-Plane metric CRS, EPSG: 3358):

source: base cartography (``nc_spm_08/PERMANENT``; source: https://grassbook.org/datasets/datasets-3rd-edition/)
hu: alap kartogáfia (``nc_spm_08/PERMANENT``; forrás: https://grassbook.org/datasets/datasets-3rd-edition/)

source: Latitude-Longitude location (LatLong WGS84, EPSG:4326):
hu: Szélesség-hosszúság (LatLong WGS84, EPSG:4326):

source: 16-days NDVI, MOD13C1, V006, CMG 0.05 deg res. (``latlong/modis_ndvi_global/``; source: https://lpdaac.usgs.gov/dataset_discovery/modis/modis_products_table/mod13c1_v006)
hu: 16-nap NDVI, MOD13C1, V006, CMG 0.05 fok felbontás (``latlong/modis_ndvi_global/``; source: https://lpdaac.usgs.gov/dataset_discovery/modis/modis_products_table/mod13c1_v006)

source: CORINE Landcover 2012, g100_clc12_V18_5 (``eu_laea/corine_2012/``; source: https://land.copernicus.eu/pan-european/corine-land-cover/clc-2012)
hu: CORINE felszínborítás 2012, g100_clc12_V18_5 (``eu_laea/corine_2012/``; source: https://land.copernicus.eu/pan-european/corine-land-cover/clc-2012)

source: Note that only selected datasets are available to the demo user (access is managed on a per-user base).
hu: Vegye figyelembe, hogy csak a kiválasztott adatállományokat érheti el a demó felhasználó (a hozzáférés felhasználónként kezeljük).

source: List locations, mapsets and maps
hu: Helyek, térképhalmazok és térképek listázása

source: In order to list the locations the user has access to, run
hu: A felhasználó által hozzáférhető helyek listázásához futassa

source: The following command lists mapsets of current location in the active GRASS GIS session (nc_spm_08):
hu: A kövtkező parancs az aktuális hely térképhalmazait listázza az aktuális GRASS GIS munkamenetben (nc_spm_08):

source: All following commands can be executed in any active GRASS GIS location, since the location name at the actinia server is explicitly provided. In case the location option is not provided, the active location will be used. The following command lists mapsets of the provided location **latlong**:
hu: Az összes következő parancsot bármelyik aktív GRASS GIS helyről végrehajthatjuk, mivel a hely neve az actinia szerverben expliciten adott. Ha a hely paramétert nem adjuk meg, akkor az aktív helyet használjuk. A következő parancs a térképhalmazokat listázza a megadott **latlong** helyen:

source: To list all raster maps available in the specified mapset belonging to the provided location **latlong**, run:
hu: Az összes raszter térkép listázásához a megadott térképhalmazban a **latlong** helyen, futtassa:

source: To list all vector maps available in the specified mapset belonging to the current or a provided location, run:
hu: Az összes vektortérkép listájához az aktuális vagy megadott helyhez tartozó megadott térképhalmazban, futtassa:

source: List all raster maps in a location/mapset different from the current session location:
hu: Az összes rasztertérkép listájához az aktuális munkamenet helyétől eltérő helyen/térképhalmazban:

source: Acessing maps in a different mapset
hu: Térképek elérése másik térképhalmazból

source: Simply use ``@name_of_mapset``.
hu: Használja a ``@name_of_mapset``-et.

source: Job management
hu: Munkakezelés

source: The ``ace`` tool can list jobs, choose from ``all``, ``accepted``, ``running``, ``terminated``, ``finished``, ``error``.
hu: Az ``ace`` eszköz a munkákat tudja listázni, válasszon ezekből `all``, ``accepted``, ``running``, ``terminated``, ``finished``, ``error``.

source: Show finished job(s) (note: the actual response may differ):
hu: Befejezett munkák megjelenítése (az aktuális válasz eltérő lehet):

source: Show running job(s):
hu: Futó munka(k ) megjelenítése:

source: Show details about a specific job:
hu: Részletek megjelenítése egy bizonyos munkáról:

source: Inspecting the REST call prior to submission
hu: A REST-hívás ellenőrzése az elküldés előtt

source: To generate the actinia process chain JSON request simply add the –dry-run flag:
hu: Az actinia feldolgozás lánc JSON kérés generálásához adja meg a –dry-run kapcsolót:

source: which will deliver the output:
hu: ez a következő outputot szolgáltatja:

source: Available export formats
hu: Elérhető export formátumok

source: At time the following export formats are currently supported:
hu: Jelenleg a következő export formátumokat támogatjuk:

source: raster: ``GTiff``
hu: raszter: ``GTiff``

source: vector: ``ESRI_Shapefile``, ``GeoJSON``, ``GML``
hu: vektor: ``ESRI_Shapefile``, ``GeoJSON``, ``GML``

source: table: ``CSV``, ``TXT``
hu: tábla: ``CSV``, ``TXT``

source: The vector formats will be extended in future versions of actina with Geopackage and SQLite formats.
hu: A vektor formátumokat a jövőbeli actinia verziókban kibővítjük a GeoPackage és SQLite formátumokkal.

source: Displaying a map - map rendering
hu: Egy térkép megjelenítése - térképrajzolás

source: It is very easy (and fast) to render a map:
hu: Nagyon egyszerű (és gyors) a térképrajzolás:

source: ESA Globcover map shown by actinia
hu: ESA Globcover térkép actinia-val megjelenítve

source: Examples for ephemeral processing
hu: Példák az efemer feldolgozásra

source: Ephemeral processing is the default processing approach of actinia. Each single command or all commands in a shell script, will be executed in an ephemeral mapset. This mapset will be removed after processing. The output of GRASS GIS modules can be marked for export, to store the computational result for download and further analysis.
hu: Az efemer feldolgozás az actinia alapértelmezett feldolgozási módszere. Minden egyes önálló parancsot vagy az összes parancsot egy burok szkriptben egy efemer térképhalmazban hajtunk végre. Ezt a térképhalmazt a feldolgozás után eltávolítjuk. A GRASS GIS modulok outputját megjelölhetjük exportra, a számítási eredmények tárolására letöltéshez vagy további elemzéshez.

source: Command line examples
hu: Parancssori példák

source: Run the module ``g.list`` in the location defined by the active GRASS GIS session in an ephemeral mapset, that has only the PERMANENT mapset in its search path:
hu: Futtassa a ``g.list`` modult az aktív GRASS GIS munkamenet által meghatározott helyen egy efemer térképhalmazban, mely csak PERMANENT térképhalmazt tartja a keresési útvonalon:

source: Run the module ``g.region`` in a new ephemeral location, to show the default region of a temporary mapset:
hu: Futtassa a ``g.region`` modult egy új efemer helyen az ideiglenes térképhalmaz alapértelmezett régiójának megjelenítéséhez:

source: Script examples
hu: Szkript példák

source: Example 1: computing slope and aspect and univariate statistics from an elevation model
hu: 1. példa: lejtés, kitettség és egyváltozós statisztikák számítása egy magasság modellből

source: The following commands (to be stored in a script and executed with ``ace``) will import a raster layer from an internet source as raster map ``elev``, sets the computational region to the map and computes the slope. Additional information about the raster layer are requested with ``r.info``.
hu: A következő parancsok (egy szkriptben tárolandó és ``ace``-val végrehajtandó) egy raszter réteget importálnak egy internetes forrásból ``elev`` névvel, beállítják a számítási régiót a térképhez és kiszámítja a lejtést. További információt kérünk az ``r.info``.val.

source: Store the following script as text file ``ace_dtm_statistics.sh``:
hu: Tárolja a következő szkriptet mint egy szövegfájl ``ace_dtm_statistics.sh``:

source: Save the script in the text file to ``/tmp/ace_dtm_statistics.sh`` and run the saved script as
hu: Mentse el a szkriptet a ``/tmp/ace_dtm_statistics.sh`` szövegfájlba és futtassa a mentett szkriptet

source: The results are provided as REST resources.
hu: Az eredményeket min REST erőforrásokat kapjuk meg.

source: To generate the actinia process chain JSON request simply add the –dry-run flag
hu: Az actinia feldolgozás lánc JSON kérés generálásához adja meg a –dry-run kapcsolót:

source: The output should look like this:
hu: Így kell kinéznie az outputnak:

source: Example 2: Orthophoto image segmentation with export
hu: Példa 2: ortofotó kép szegmentáció exporttal

source: Store the following script as text file ``/tmp/ace_segmentation.sh``:
hu: Tárolja a következő szkriptet mint egy szövegfájlt ``/tmp/ace_segmentation.sh``:

source: Run the script saved in a text file as
hu: Futtassa a szövegfájlba mentett parancsfájlt

source: Examples for persistent processing
hu: Példák az állandó feldolgozásra

source: GRASS GIS commands can be executed in a user specific persistent database. The user must create a mapset in an existing location. This mapsets can be accessed via ``ace``. All processing results of commands run in this mapset, will be stored persistently. Be aware that the processing will be performed in an ephemeral database that will be moved to the persistent storage using the correct name after processing.
hu: A GRASS GIS parancsok végrehajthatóak egy felhasználó által megadott állandó adatbázisban. A felhasználónak létre kell hoznia egy térképhalmazt egy létező helyen. Ezt a térképhalmazt elérhetjük a ``ace``-n keresztül. Ebben a térképhalmazban futtatott parancsok összes feldolgozási eredményét tartósan tároljuk. Ne felejtse el, hogy a feldolgozást egy efemer adatbázisban hajtjuk végre, amelyet a feldolgozás után a helyes névvel áthelyezzük a tartós tárhelyre.

source: To create a new mapset in the **nc_spm_08** location with the name **test_mapset** the following command must be executed
hu: Egy új térképhalmaz létrehozásához az **nc_spm_08** helyen, **test_mapset** névvel a következő parancsot kell végrehajtania

source: Run the commands from the statistic script in the new persistent mapset
hu: Futtassa a parancsokat a statisztika szkriptből egy új tartós térképhalmazban

source: Show all raster maps that have been created with the script in test_mapset
hu: A test_mapset-ben lévő parancsfájllal létrehozott rasztertérképek megjelenítése

source: Show information about raster map elev and slope_elev
hu: Az elev és slope_elev térképekről információ megjelenítése

source: Delete the test_mapset
hu: Törölje a test_mapset-et

source: If the active GRASS GIS session has identical location/mapset settings, then an alias can be used to avoid the persistent option in each single command call:
hu: Ha az aktív GRASS GIS munkamenet azonos hely/térképhalmaz beállításokkal rendelkezik, akkor egy aliast lehet használni, hogy elkerülje a tartós beállítást minden egyes parancs hívásban:

source: We assume that in the active GRASS GIS session the current location is **nc_spm_08** and the current mapset is **test_mapset**. Then the commands from above can be executed in the following way:
hu: Feltételezzük, hogy az aktív GRASS GIS munkamenetben az aktuális hely **nc_spm_08** és az aktuális térképhalmaz **test_mapset**. Ekkor a fenti parancsok a következő módon hajthatók végre:

source: Super admin tasks
hu: Super adminisztrátori feladatok

source: Creation of new locations
hu: Új helyek létrehozása

source: Installing of GRASS GIS addons (extensions)
hu: GRASS GIS bővítmények telepítése

source: Further reading
hu: További olvasmányok

source: Visit the actinia website at `https://actinia.mundialis.de <https://actinia.mundialis.de>`_
hu: Látogassa meg az actinia honlapot `https://actinia.mundialis.de <https://actinia.mundialis.de>`_
