Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/ideditor_quickstart.po
Languages: hu

source: iD editor Quickstart
hu: iD editor gyorstalpaló

source: The iD editor is the de facto, browser-based OpenStreetMap editor. iD is fast and easy to use, and allows mapping from various data sources such as satellite and aerial imageries, GPS, Field Papers or Mapillary.
hu: Az iD editor gyakorlatilag aböngésző alapú OpenStreetMap szerkesztő. Az iD gyors és könnyen használható és lehetővé teszi a térképezést különböző forrásokból, mint például műhold és légi felvételek, GPS, jegyzőkönyvek vagy Mapillary.

source: The iD editor is a great way to edit for small and easy changes that don't require the advanced features of JOSM (a more advanced mapping editor). This chapter demonstrates the basics of editing with iD.
hu: Az iD editor egy nagyszerű lehetőség a kis és egyszerű módosításokra, melyek nem igénylik a JOSM speciális funkcióit (egy kifinomultabb térkép szerkesztő). Ez a fejezet az alap szerkesztéseket mutatja be az iD-vel.

source: Starting the iD Editor
hu: iD Editor indítása

source: The iD editor requires an active connection to the Internet.
hu: Az iD editornak egy aktív internet kapcsolatra van szüksége.

source: Open your Internet browser, and go to the OpenStreetMap website at http://www.openstreetmap.org.
hu: Nyissa meg az internet böngészőjét és menjen az OpenStreetMap honlapra http://www.openstreetmap.org.

source: **Login** using your OpenStreetMap account.
hu: Jelentkezzen be az OpenStreetMap bejelentkezésével.

source: Pan and zoom the map to the area that you wish to edit. You can pan by holding the left mouse button and dragging the map to your desired area.
hu: Tolja el és nagyítsa a térképet a szerkesztendő területre. Tolhatja a bal egérgomb nyomva tartásával és a térkép húzásával a szükséges területre.

source: Click on the small arrow next to **Edit**. Then click **Edit with iD (in-browser editor)**.
hu: Kattintson a kis nyílra az **Edit** mellett. Majd kattintson az **Edit with iD (in-browser editor)**-ra.

source: iD Editor User Interface
hu: iD Editor felhasználói interfész

source: **Edit Feature Panel:** This panel shows tags from the object selected on the map.
hu: **Edit Feature Panel:** Ez a panel a térképen kiválasztott objektum tegeit jeleníti meg.

source: You can add or edit tags from this panel.
hu: Hozzáadhat és szerkeszthet tegeket ebből a panelből.

source: **Tools:** This panel shows basic editing tools:
hu: **Tools:** Ez a panel az alapvető szerkesztő eszközöket tartalmazza:

source: Draw point (node), *shortcut key* **1** |image3|
hu: Rajzoljon egy pontot (csomópontot) *gyors billentyű* **1** |image3|

source: Draw line (way), *shortcut key* **2** |image4|
hu: Rajzoljon egy vonalat (út) *gyorsbillentyű* **2** |image4|

source: Draw shape (polygon), *shortcut key* **3** |image5|
hu: Rajzoljon egy alakzatot (felület), *gyorsbillentyű* **3** |image5|

source: Undo, *shortcut keys* **Ctrl+z** |image6|
hu: Visszavonás, *gyorsbillentyű* **Ctrl+z** |image6|

source: Redo, *shortcut keys* **Ctrl+y** |image7|
hu: Ismét, *gyordbillentyű* **Ctrl+y** |image7|

source: Save changes, *shortcut keys* **Ctrl+s** |image8|
hu: Változások mentése, *gyorsbillentyű* **Ctrl+s** |image8|

source: **Map panel:** This panel show various configuration functions:
hu: **Térkép panel:** Ez a panel különböző konfigurációs funkciókat jelenít meg:

source: Zoom In, *shortcut key* **+** |image9|
hu: Nagyítás. *gyorsbillentyű* **+** |image9|

source: Zoom Out, *shortcut key* **-** |image10|
hu: Kicsinyítés, *gyorsbillentyű* **-** |image10|

source: Go to your location |image11|
hu: Ugrás a tartózkodási helyére |image11|

source: Configure background layer, *shortcut key* **b**
hu: Háttér réteg konfigurálása, *gyorsbillentyű* **b**

source: Map Data, *shortcut key* **f**
hu: Térkép adatok, *gyorsbillentyű* **f**

source: Open Help Menu, *shortcut key* **h**
hu: Súgó menü megnyitása, *gyorsbillentyű* **h**

source: **Information panel:** This panel shows various information, such as the scale bar and which users have contributed to the area.
hu: **Információpanel:** Ez a panel különböző információkat jelenít meg, mint például a lépték vonalzó. melyik felhasználó dolgozott a területen.

source: Configuring the Background Layer
hu: Háttér réteg konfigurálása

source: Click the **Background settings** button or use the *shortcut key* **b**. |image14|
hu: Kattintson a **Background settings** gombra vagy használja a **b** *gyorsbillentyűt*. |image14|

source: To change the **brightness level** click one of these boxes, the levels are 100%, 75%, 50%, and 25% |image16|
hu: A **fényességi szint** változtatásához kattintson a az egyikre a téglalapok közül, a lehetséges szintek 100%, 75%, 50%, és 25% |image16|

source: You also can **change the background layer** based on your desired tile provider (the default is Bing Aerial Imagery).
hu: **Módosíthatja a háttér réteget** is a kívánt csempe szolgáltató alapján (az alapértelmezett a Bing Aerial Imagery).

source: You can add your own map tiles by clicking on **Custom**. For example, if you want to **add a Field Paper** [1], click **Custom** then click on the magnifying glass (search) icon to open the following window:-
hu: A **Custom**-ra kattintva hozzáadhatja a saját térképcsempéit. Például, ha egy **terepi papírtérképet** [1] akar hozzáadni, kattintson a **Custom**-ra , utána kattintson a nagyító (keresés) ikonra a következő ablak megnyitásához:

source: |image17| and enter your **FieldPaper snapshot URL**, which will be something like this: http://fieldpapers.org/snapshot.php?id=cqhmf2v9#18/37.80593/-122.22715
hu: |image17| és írja be a **terepi papírtérkép URL-jét**, ami valami ilyesmi: http://fieldpapers.org/snapshot.php?id=cqhmf2v9#18/37.80593/-122.22715

source: To **display GPS tracks from your computer** (GPX format), drag and drop the GPX file into iD editor.
hu: **GPS trackek megjelenítéséhez a számítógépéről** (GPX formátum) húzza a GPX fájlt az iD szerkesztőre és engedje el.

source: To enable **OpenStreetMap GPS traces** click on the box. In the image below, public GPS traces are shown in various colors, indicating the direction of travel.
hu: Az **OpenStreetMap GPS nyomvonalak** bekapcsolásához kattintson a négyzetbe- Az alábbi képen a GPS nyomvonalak különböző színekkel jelennek meg, az utazás irányát jelölve.

source: If there is `imagery offset </en/josm/aerial-imagery>`__, you can **correct the imagery offset** by clicking **Fix Alignment**.
hu: Ha a `kép eltolódást </en/josm/aerial-imagery>`__ tapasztal, akkor **korrigálhatja a kép eltolódást** a **Fix Alignment**-re kattintva.

source: Click the navigation buttons to move the imagery. Click the reset button to return to the default position. |image20|
hu: Kattintson a navigációs gombokra a kép mozgatásához. Kattintson a visszaállít gombra a visszatéréshez az alapértelmezett pozícióhoz. |image20|

source: Basic Editing with iD
hu: Alap szerkesztések iD-vel

source: Adding Points
hu: Pontok hozzáadása

source: To add a new point, click on the **Point** button. |image3|
hu: Egy új pont hozzáadásához kattintson a **Point** gombot. |image3|

source: Your mouse cursor will change into plus (+) sign. Now, click on a position that you know to mark a location. For example, if you know that there is a hospital in your area, click on the position of the hospital building.
hu: Az egér mutató plusz (+) jellé változik. Most kattintson egy pozícióba, ahol meg akar jelölni egy helyet. Például, ha tudja, hogy van egy kórház a területén, kattintson a kórház épület helyére.

source: Notice that a new point is added. At the same time, the left panel will change to show a form where you can select attributes for the object. Click **Hospital Grounds** to tag the point as a hospital.
hu: Vegye észre, hogy egy új pontot adtunk hozzá. Ezzel egyidőben megváltozik a baloldali panel, egy űrlapot jelenít meg, ahol kiválaszthatja az objektum attribútumait. Kattintson a **Hospital Grounds**-ra, hogy a pontot kórházként jelölje meg.

source: You can use the forms to fill detail information about your point. You can fill hospital name, address, and/or other additional information. Note that each feature will have different options, depending on what tag you choose from the feature panel.
hu: Az űrlapokat használhatja a pont részletes adatainak megadására. Kitöltheti a kórház nevét, címét és/vagy más további információt. Ne feledje, hogy minden elemnek különböző beállításai lesznek, attól függően, hogy melyik címkét választja a funkciópanelből.

source: If you make a mistake, such as a wrong location, you can move your point to a new location by holding the left mouse button on your point and dragging it. Or, if you want to delete your point, click the left mouse button on the point, activate the context menu by clicking with the right mouse button and then click the button which looks like a trashcan. |image23|
hu: Ha hibázik, például rossz a pozíció, áthelyezheti a pontot egy új helyre úgy, hogy az egér bal gombját lenyomva tartja, és áthúzza. Vagy, ha törölni szeretné a pontot, kattintson az egér bal gombbal a pontra, aktiválja a helyi menüt a jobb egérgombbal kattintva, majd kattintson a gombra, amely úgy néz ki, mint egy szemétláda. | image23 |

source: A "point" created in the iD editor is actually a standalone "node" with a set of "tags" on it.
hu: Az iD szerkesztőben létrehozott "pontunk" aktuálisan egy önálló "csomópont" a "címkék" egy csoportjával.

source: Drawing Lines
hu: Vonalak rajzolása

source: To add a new line, click on the **Line** button. |image4|
hu: Egy új vonal hozzáadásához kattintson a **Line** gombra |image4|

source: Your mouse cursor will change into plus (+) sign. Find a road that hasn’t been drawn on the map and trace it. Click once on a point where the road segment begins, move your mouse, and click to add additional points. Double-click to end the drawing process. Notice the panel on the left.
hu: Az egér mutató plusz (+) jellé változik. Keressen a térképen még nem megrajzolt utat és kövesse azt. Kattintson a pontra ahol az útszakasz kezdődik, mozgassa az egerét és kattintson a további pontokra. Duplán kattintson a rajzolás befejezéséhez. Figyelje a baloldali panelt.

source: Just as with a point, select the appropriate tags for your line.
hu: Ugyanúgy mint egy pontnál, válassza ki a megfelelő címkéket a vonalához.

source: You can drag points from the line by clicking your left mouse button on a point and dragging it.
hu: Elhúzhatja a vonal pontjait a bal egérgombbal kattintson egy pontra és húzza el azt.

source: You also can move the whole line by selecting it, and choosing the **Move tool**. Then drag the line to a new position. |image30|
hu: Teljes vonalat is mozgathat, válassza ki a vonalat és válassza a **Mozgatás eszközt**. Ezután húzza a vonalat egy új pozícióba. |image30|

source: When you click your left mouse button on an individual point (node) on the line and click on the right mouse button to activate the context menu, you will see these tools:
hu: Ha rákattint a bal egérgombbal egy vonal bizonyos pontjára (csomópontjára) és a jobb egérgombra kattintva aktiválja a helyi menüt, ezeket az eszközöket fogja látni:

source: Delete point from line. |image23|
hu: Pont törlése a vonalból. |image23|

source: Disconnect point from line. |image26|
hu: Pont leválasztása a vonalról. |image26|

source: Split a line into two lines from the point you’ve selected. |image27|
hu: Vonal szétvágása két vonalra a szelektált pontnál. |image27|

source: When you click your left mouse button on a line (but not on a point), you will see these tools:
hu: Amikor a bal egérgombbal egy vonalra (de nem egy pontra) kattint, ezeket az eszközöket látja:

source: Delete line. |image23|
hu: Vonal törlés. |image23|

source: Create a circle from a line (only active if the line is closed) |image29|
hu: Kör létrehozása egy vonalból (csak akkor aktív, ha zárt a vonal) |image29|

source: Move line |image30|
hu: Vonal mozgatás |image30|

source: Form a square shape from a line (only active if the line is closed) |image31|
hu: Négyzet alakzat kialakítása egy vonalból (csak akkor aktív, ha zárt a vonal) |image31|

source: Reverse line direction (good for rivers & one-way streets) |image32|
hu: Vonalirány megfordítása (hasznos folyókhoz és egyirányú utcákhoz) |image32|

source: A "line" created in the iD editor is actually a "way" with "tags" on it.
hu: Az iD szerkesztőben létrehozott "vonal" tulajdonképpen egy "út" "címkékkel".

source: A special note about **Deleting**: In general you should avoid deleting other people's mapping if it just needs improvement. You can delete your own mistakes, but you should try to *adjust* other people's mapped objects if they need changes. This preserves the history of the items in the OSM database and is respectful of fellow mappers. If you really feel something should be deleted, consider asking the original mapper or one of the OSM email lists about it first.
hu: Egy speciális megjegyzés a **Törléshez**: általánosságban kerülni kell mások térképezésének a törlését, ha csak javításra szorul. Törölheti a saját hibáit, de meg kell próbálnia *javítani* más emberek által térképezett objektumokat, ha módosítást igényelnek. Ez megőrzi az elemek történetét az OSM adatbázisban és tisztességes a térképező társakkal szemben. Ha igazán úgy érzi, hogy törölni kellene valamit, fontolja meg az eredeti térképező vagy az egyik OSM levelezőlista megkérdezését erről először.

source: Drawing Shapes (Polygons)
hu: Alakzatok (zárt idomok) rajzolása

source: To add a new multi-sided shape, click on the **Area** button.
hu: Egy új több oldalú alakzat hozzáadásához kattintson a **terület** gombra.

source: Your mouse cursor will change into plus (+) sign. Try to trace a building using the imagery as a guide.
hu: Az egérkurzor plusz (+) jellé változik. Próbáljon egy épületet követni a képet használva útmutatóként.

source: You will notice that the color of your shape will change depending on the attributes that you assign to it. |image35|
hu: Észreveheti, hogy az alakzat színe a hozzá hozzárendelni kívánt attribútumtól függően megváltozik. |image35|

source: The tools that are available when you select a shape and activate the context menu with the right mouse button are similar to those when you click on a line.
hu: Egy alakzat kiválasztása és a jobb gombbal a felbukkanó menü aktiválása esetén a rendelkezésre álló eszközök hasonlóak ahhoz, amikor egy vonalra kattint.

source: A "polygon" in the iD editor is actually a "closed way" with tags on it.
hu: Egy **zárt alakzat** az iD szerkesztőben címkékkel ellátott "zárt út".

source: Drawing Multipolygons
hu: Többszörös zárt alakzatok rajzolása

source: Sometimes you have to draw a polygon which does not only have an outer contour but also one or more inner contours. Just think of buildings with inner courtyards or lakes with islands. *Do not draw all these ways in one line* so that the inner contours suspend from the outer contour. Rather draw these contours separate, attach tags to the outer contour only, select all contours and hit **c** in order to combine them into what is called a multipolygon.
hu: Időnként egy olyan zárt idomot kell rajzolnia, mely nem csak egy külső határral, hanem egy vagy több belső határral rendelkezik. Gondoljon egy épületekre belső udvarral vagy tavakra szigetekkel. *Ne rajzolja ezeket egy vonallal*, úgy hogy a belső körvonalat ráakasztja a külsőre. Inkább ezeket a körvonalakat rajzolja meg külön, kapcsolja a címkéket csak a külső körvonalhoz, válassza ki az összes körvonalat és nyomja meg a **c** billentyűt, hogy egy többszörös körvonallal rendelkező elemmé tegye őket össze.

source: When you select any of the contours of the newly created multipolygon you can see on the left to which multipolygons it belongs
hu: Amikor az újonnan létrehozott többszörös határral rendelkező elem bármelyik körvonalát kiválasztja, a bal oldalon láthatja melyik elemhez tartozik az

source: Saving Your Changes
hu: Változtatásainak mentése

source: When (and if) you want to save your edits to OpenStreetMap, click the
hu: Amikor (és ha)menteni akarja a szerkesztéseit az OpenStreetMap-be kattintson a

source: **Save** button. The panel on the left will show the upload panel.
hu: **Save** gombra. A baloldali panel jeleníti meg a feltöltés panelt.

source: Enter a comment about your edits and click **Save**.
hu: Írja be a megjegyzését a szerkesztéseihez és kattintson a **Save**-re.

source: If you have edited the same feature (point, way or area) at the same time as another person was editing it, you will receive a warning that your edits cannot be uploaded until you have resolved the **conflicts** - choose whose edits to accept & upload your changes. *Resolving conflicts often involves accepting the other persons edits, in which case you will probably wish to return to the feature in question and edit again (**this time save soon after the edit to try to avoid a conflict again!**).*
hu: Ha ugyanazt a elemet (pont, út, terület) ugyanakkor szerkeszti amikor egy másik személy szerkeszti azt, egy figyelmeztetést kap, hogy a szerkesztései nem tölthetők fel amíg a **konfliktusokat** nem oldja fel. - válasszon kinek a szerkesztését fogadja el és töltse fel a módosításait. *A konfliktusok feloldása gyakran más személyek szerkesztéseinek elfogadását jelenti, ebben az esetben vissza kíván térni a kérdéses elem szerkesztéséhez (**ezúttal mentsen gyorsan a szerkesztés után, hogy megpróbálja elkerülni a konfliktust!**).*

source: Additional Information and Custom Tags
hu: További információ és egyéni címkék

source: When you are editing an object, you will see a strip of icons at the bottom of the attribute panel. You can add additional information by clicking these icons:
hu: Ha egy objektumot szerkeszt, akkor az attribútum panel alján megjelenik egy ikonsáv. Az ikonokra kattintva további információkat is hozzáadhat:

source: Add elevation |image37|
hu: Magasság hozzáadása |image37|

source: Add notes |image38|
hu: Megjegyzés hozzáadása |image38|

source: Add contacts / phone number |image39|
hu: Kontaktok / telefonszámok hozzáadása |image39|

source: Add source tag |image40|
hu: Forrás címke hozzáadása |image40|

source: Add website |image41|
hu: Weboldal hozzáadása |image41|

source: Add accessibility information |image42|
hu: Kisegítő lehetőségekkel kapcsolatos információk hozzáadása |image42|

source: Add Wikipedia link |image43|
hu: Wikipedia link hozzáadása |image43|

source: Or, you can add custom tags by clicking **All tags**. |image44|
hu: Vagy egyéni címkéket adhat meg a **Minden címké**-re kattintva. |image44|

source: This will show all the tags attached to the feature.
hu: Ez megmutatja az elemhez kapcsolt összes címkét.

source: Click the plus sign (+) to add keys and values or click the trash icon to delete tags.
hu: Kattintson a plusz (+) jelre kulcsok és értékek hozzáadásához vagy kattintson a szemetes ikonra a címkék törléséhez.

source: iD versus JOSM
hu: iD vagy JOSM

source: **iD is good for...**
hu: **Az iD jó erre...**

source: When you are doing simple edits
hu: Amikor egyszerű szerkesztéseket végez

source: When you have fast Internet to load the imagery and save the edits
hu: Amikor gyors internete van a képek betöltéséhez és a szerkesztések mentéséhez

source: When you want to be sure to follow a consistent and simple tagging scheme
hu: Amikor biztos akar lenni abban, hogy egy konzisztens és egyszerű címkerendszert követ

source: When you are restricted from installing a program on the computer you are using
hu: Amikor az ön által használt számítógépen korlátozták a programok telepítéséhez a jogát

source: **JOSM is better...**
hu: ** A JOSM jobb ebben...**

source: When you are adding many buildings (See buildings_tool plugin)
hu: Amikor sok épületet szerkeszt (lásd a buildings_tool modult)

source: When you are editing many polygons or lines that already exist
hu: Amikor sok már létező zárt idomot vagy vonalat szerkeszt

source: When you are on an unreliable Internet connection or offline
hu: Amikor nem megbízható internet kapcsolata vagy kapcsolat nélkül dolgozik

source: When you are using a specific tagging scheme (or custom presets)
hu: Amikor speciális címke sémát (vagy egyéni alapbeállításokat) használ

source: What Next?
hu: Mi a következő?

source: Try the LearnOSM documentation, from which this quickstart was derived: http://learnosm.org/en/beginner/id-editor/
hu: Próbálja meg a LearnOSM dokumentációt, melyből ezt a gyorstalpaló származik: http://learnosm.org/en/beginner/id-editor/
