Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/istsos_quickstart.po
Languages: hu

source: istSOS Quickstart
hu: istSOS gyorstalpaló

source: istSOS is an OGC `SOS <http://www.opengeospatial.org/standards/sos>`__ server implementation written in `Python <https://www.python.org/>`__. istSOS allows for managing and dispatch observations from monitoring sensors according to the Sensor Observation Service standard.
hu: Az istSOS egy OGC `SOS <http://www.opengeospatial.org/standards/sos>`__ szerver implementáció, melyet `Pythonban <https://www.python.org/>`__ írnak. Az istSOS lehetővé teszi az észlelések továbbítását a szenzortól a Sensor Observation Service szabványnak megfelelően.

source: The project provides also a Graphical user Interface that allows for easing the daily operations and a RESTFull Web api for automatizing administration procedures.
hu: A projekt egy grafikus felhasználói felületet is biztosít, hogy megkönnyítse a napi műveleteket és egy RESTFul API-t az adminisztrációs eljárások automatizálására.

source: istSOS is released under the GPLv2 licence, and runs on all major platforms (Windows, Linux, Mac OS X), even though it has been used in production in linux environment only.
hu: Az istSOS-t a GPLv2 licenc alatt bocsájtják ki és minden elterjedtebb platformon fut (Windows, Linux, Mac OS X), annak ellenére, hogy csak Linux környezetben használják élesben.

source: Create postgis database
hu: PostGIS adatbázis létrehozása

source: Open a terminal and execute the following commands:
hu: Nyisson egy terminált és hajtsa végre a következő parancsokat:

source: Setting up an istSOS service instance
hu: Egy istSOS szolgáltatás példány beállítása

source: With istSOS you can organize your sensor data in different instances. Every instance has its own database schema independent from other instances. You can even deploy other databases over your network according to your needs.
hu: Az istSOS a szenzorok adatait különböző adatbázis példányokba rendezheti. Minden példány a többi példánytól független saját adatbázis-sémával rendelkezik. Az igényeinek megfelelően a hálózaton keresztül más adatbázisokat telepíthet.

source: The first steps into istSOS setup is to configure the default configuration options. These options will then be automatically used for your convenience by every new istSOS instance created.
hu: Az első lépés az istSOS beállításában az alapértelmezett beállítások konfigurálása. Ezeket a beállításokat használjuk a kényelme érdekében minden új istSOS példány létrehozásánál.

source: **1) Open the Web Admin interface**
hu: **1) Nyissa meg a Web Admin interfészt**

source: Open a browser and go to `<http://localhost/istsos/admin>`_
hu: Nyisson meg egy böngészőt és menjen ide `<http://localhost/istsos/admin>`_

source: **2) Configure your database connection**
hu: **2) Állítsa be az adatbázis kapcsolatokat**

source: From the toolbar buttons menu press the "Database" button and fill in the database configuration options:
hu: Az eszközsor gombjai közül nyomja meg a "Database" gombot és töltse ki az adatbázis konfiguráció beállításait:

source: **3) Configure the default Service provider information**
hu: **3) Állítsa be az alapértelmezett szolgáltató adatait**

source: Press the "Service provider" button and fill it using your institutional information.
hu: Nyomja meg a "Service provider" gombot és töltse ki a szervezeti adatait.

source: **4) Configure the default Service identification information**
hu: **4) Konfigurálja az alapértelmezett szolgáltatás azonosító információt**

source: Press the "Service identification" button and fill up with custom metadata that describe the service usage.
hu: Nyomja meg a "Service identification" gombot és töltse ki egyedi metaadatokkal a szolgáltatás használatának leírásához.

source: **5) Configure your service coordinates system**
hu: **5) Konfigurálja a szolgáltatása koordináta-rendszerét**

source: Press the "Coordinates system" button to manage the Coordinate Reference System (CRS).
hu: Nyomja meg a "Coordinates system" gombot a koordináta referencia rendszer (CRS) kezeléséhez.

source: *Default EPSG code*: this will be the native Coordinate Reference System of your geometries in the database.
hu: *Default EPSG code*: ez lesz az adatbázisban tárolt geometriák koordináta referencia rendszere.

source: *Permitted EPSG*: here you can configure which other Coordinate Reference Systems your system will support and reproject if requested.
hu: *Permitted EPSG*: itt konfigurálhatja melyik másik koordináta-rendszerbe átvetítést fogja támogatni a rendszere, ha szükséges.

source: **6) Configure your getobservation request options**
hu: **6) Konfigurálja a getobservation kérés beállításait**

source: From the toolbar buttons menu press the "GetObservation Configuration" button to set maximum time interval per getObservation request (zero for no limits) and aggregation no-data value.
hu: Az eszközsor gombjai közül nyomja meg "GetObservation Configuration" gombot a getObservation kérés maximális időintervallumának és az aggregált nincs-adat érték beállításához.

source: **7) Configure your service proxy address**
hu: **7) Konfigurálja a szolgáltatása proxy címét**

source: The Proxy URL field is the base URL seen beyond a reverse proxy.
hu: A proxy URL mező a reverse proxy mögött látható alap URL.

source: Create a new service
hu: Új szerviz létrehozása

source: Now that you have configured istSOS, it's time to create a new service instance.
hu: Most, hogy konfigurálta az istSOS-t, itt az ideje egy új szolgáltatás példány létrehozásának.

source: **1) Create a new service**
hu: **1) Hozzon létre egy új szolgáltatást**

source: From the toolbar buttons menu press the "new service" button:
hu: Az eszközsor gomb menüből nyomja meg a "new service" gombot:

source: Choose the name of your instance. In this workshop use the name **demo**.
hu: Válassza ki a példányának a nevét. Ebben a munkamentben használjaa **demo** nevet.

source: In the EPSG field you can set the database native projection. Leaving it empty, the default one will be used.
hu: Az EPSG mezőben az adatbázis vetületét állíthatja be. Ha üresen hagyja, az alapértelmezett értéket használjuk.

source: Clicking on the "Customize database" box, you are able to change the default database configuration for this new istSOS instance.
hu: Kattintson a "Customize database" dobozra, megváltoztathatja ennek az új istSOS példánynak az alapértelmezett adatbázis konfigurációját.

source: **2) Press “next”**
hu: **2) Nyomja meg a "next"-et**

source: As you pressed the “next” button, the server status panel is displayed. If something's gone wrong during the creation you will see here an alert.
hu: Miután megnyomta a "next" gombot, a szerver státusz panel jelenik meg. Ha valami nem sikerült a létrehozás során egy riasztást lát itt.

source: The istSOS “demo” instance has inherited all the configuration options from the default configuration. If, for any reason you decide to modify them, the changes will affect only this instance.
hu: Az istSOS "demo" példány minden konfigurációs beállítását az alapértelmezett konfigurációból örökli. Ha bármilyen okból a módosításukról dönt, a változtatások csak ezt a példányt fogják érinteni.

source: Add a new procedure
hu: Új eljárás hozzáadása

source: From the “services” drop down button of the admin interface (http://localhost/istsos/admin ) choose the desired instance.
hu: Az adminisztrációs interfész (http://localhost/istsos/admin ) lenyitható "service" gombjából válassza ki a kívánt példányt.

source: From the toolbar buttons menu press the "New procedure" button.
hu: Az eszközsor gomb menüjéből nyomja meg a "New procedure" gombját.

source: Fill in the form using appropriate information.
hu: Töltse ki az űrlapot megfelelő információkkal.

source: Once a procedure is created the outputs (observed properties) cannot be changed.
hu: Egy eljárás létrehozása után az output (észlelt tulajdonságok) nem változtatható meg.

source: *Optional parameters:* Fill at your own need and willing
hu: *Optional parameters:* töltse ki szükségletei és szándékai szerint

source: *Example* (minimal configuration)
hu: *Példa* (minimális konfiguráció)

source: *Outputs (confirm the outputs pressing the "add" button):*
hu: *Output (erősítse meg az outputot az "add" gomb megnyomásával).*

source: Register the new sensor (procedure) pressing the "submit" button.
hu: Regisztrálja az új szenzort (eljárást) a "submit" gomb megnyomásával.

source: Add new observations
hu: Új észlelések hozzáadása

source: First we will create a text file with sensor data, formatted according to "text/csv, subtype=istSOS". The file uses a Comma Separated Values (CSV) format. The first line contains header information, including URI names of the observed properties. The following lines contain the data.
hu: Először létrehozunk egy szövegfájlt a szenzor adatokkal, a "text/csv, subtype=istSOS" formátumnak megfelelően. A fájl a vesszővel elválasztott értékek (CSV) formátumot használja. Az első sor tartalmazza fejléc információt, beleértve a megfigyelt tulajdonságok URI neveit. A következő sorok tartalmazzák az adatokat.

source: Open a text editor by selecting :menuselection:`Accessories --> Leafpad`.
hu: Nyisson meg egy szövegszerkesztőt :menuselection:`Accessories --> Leafpad`.

source: Copy and paste the follwing text into the text editor window:
hu: Másolja ki és illessze be a következő szöveget a szövegszerkesztő ablakba:

source: Save the file as "T_LUGANO_20140603161000000.dat" on the Desktop. The filename convention being used is: PROCEDURENAME_YYYYMMDDhhmmssfff.dat
hu: Mentse el "T_LUGANO_20140603161000000.dat" fájlként az asztalra. A használt fájlnév konvenció: PROCEDURENAME_YYYYMMDDhhmmssfff.dat

source: Open a terminal by selecting :menuselection:`Accessories --> LXTerminal`.
hu: Nyisson egy terminált :menuselection:`Accessories --> LXTerminal`.

source: In the terminal, enter: "cd /usr/share/istsos/" and press ENTER
hu: A terminál ablakba gépelje be: "cd /usr/share/istsos/" ésnyomjameg az ENTER-t

source: Write "python scripts/csv2istsos.py -p T_LUGANO -u http://localhost/istsos -s demo -w ~/Desktop" and press ENTER
hu: Gépelje be "python scripts/csv2istsos.py -p T_LUGANO -u http://localhost/istsos -s demo -w ~/Desktop" és nyomja meg az ENTER-t

source: You should see a message "Insert observation success: True"
hu: A következő üzentet kell látnia "Insert observation success: True"

source: Click :menuselection:`Geospatial --> Webservices --> istSOS`.
hu: Kattintson ide :menuselection:`Geospatial --> Webservices --> istSOS`.

source: Click the ENTER button in the administration page
hu: Kattintson az ENTER gombra az adminisztrációs lapon

source: Click :menuselection:`Data Management --> Data Viewer`.
hu: Kattintson a :menuselection:`Data Management --> Data Viewer` menüre.

source: Select the following:
hu: Válassza a következőket:

source: Click the "Add" button
hu: Nyomja meg az "Add" gombot

source: Click the "Plot" button and check that the data have been added (watch out at your time zone!)
hu: Kattintson a "Plot" gombra és ellenőrizze, hogy az adatok bekerültek-e (figyeljen az időzónájára!)

source: What Next?
hu: Mi a következő?

source: To learn more about istSOS, a starting point is the `istSOS Documentation`_
hu: Az `istSOS Documentation`_ egy kiindulópont, hogy többet tanuljon az istSOS-ról.

source: and the `istSOS Tutorial`_.
hu: és az `istSOS Tutorial`_.
