Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/josm_quickstart.po
Languages: de

source: This quickstart covers basic usage of the Java OpenStreetMap editor.
de: Diese Quickstart-Anleitung erklärt die grundsätzliche Bedienung des Java OpenStreetmMap Editors.

source: When JOSM starts, it will look something like this:
de: Beim Start sieht die Benutzeroberfläche von JOSM in etwa so aus:

source: JOSM Preferences
de: JOSM Voreinstellungen

source: There are many different settings that you can customize in JOSM. One setting that you may want to adjust is the language. JOSM has been translated into numerous languages, and you may prefer to work in a different one.
de: In JOSM kannst Du viele verschiedene Einstellungen anpassen. Eine davon ist die Sprache der Benutzeroberfläche. Da JOSM in viele verschiedene Sprachen übersetzt ist, kannst Du Deine bevorzugte Sprache auswählen.

source: To access the Preferences window, click Edit -> Preferences.
de: Um zu den Einstellungen zu gelangen, wähle Bearbeiten -> Einstellungen im Menü.

source: On the left side, click the icon that looks like a paint can and paint brush.
de: Wähle in der Leiste auf der linken Seite das Symbol, das aussieht, wie ein Farbeimer mit einem Pinsel.

source: At the top of the window, click the tab that says “Look and Feel”.
de: Wähle oben den Reiter "Verhalten und Aussehen".

source: Choose your language in the dropdown box next to the word “Language”.
de: Wähle in der Auswahlliste neben dem Wort "Sprache" Deine gewünschte Sprache aus.

source: Click OK.
de: Betätige den Button OK.

source: You need to restart JOSM to save your settings. Click “File” in the upper left corner, and Click “Restart” near the bottom of the menu.
de: Du musst JOSM neustarten, damit die Spracheinstellung aktiv wird. Wähle "Datei -> Neu starten" im Menü.

source: Learn Basic Drawing with JOSM
de: Lerne grundsätzliches Zeichnen mit JOSM.

source: Now let’s open up a sample OSM file which we will use to learn the basic ways to draw maps with JOSM. Note that this map is not real, in that it is not a real map of a real place, so we will not save it on OpenStreetMap.
de: Öffnen wir nun eine OSM Beispieldatei, an der wir die grundlegende Erstellung von Karten mit JOSM lernen. Da diese Karte keinen realen Ort repräsentiert, werden wir sie natürlich nicht in Openstreetmap speichern.

source: Download the file here: `sample.osm <http://learnosm.org/files/sample.osm>`__
de: Laden wir nun diese Datei herunter: `sample.osm <http://learnosm.org/files/sample.osm>`__

source: Now let’s open the sample map file in JOSM. Click the “Open” button in the upper left.
de: Öffne die eben heruntergeladene Datei in JOSM durch Auswählen der Schaltfläche "Öffnen" oben links.

source: Find the file **sample.osm**. It is probably in your Downloads folder, unless you saved it somewhere else. Click on it, and then click “Open”.
de: Finde die Datei **sample.osm**. Sie befindet sich wahrscheinlich im Ordner "Downloads", es sei denn Du hast sie woanders gespeichert. Wähle die Datei aus und dann die Schaltfläche "Öffnen".

source: You should now see a sample map that looks like this:
de: Nun solltest Du eine Beispielkarte sehen, die so aussieht:

source: You will use these data in order to try various editing techniques. *You must however never upload these fictitious data to the database.*
de: Du wirst diese Daten nutzen, um verschiedene Bearbeitungstechniken auszuprobieren. *Niemals jedoch sollen diese fiktiven Daten in die Datenbank hochgeladen werden.*

source: Basic Operations
de: Grundlegende Vorgehensweisen

source: To move the map left or right, up or down, hold your right mouse button down, and move your mouse.
de: Um die Karte nach links, rechts, oben oder unten zu bewegen, halte die rechte Maustaste gedrückt und bewege dabei die Maus.

source: There are several ways to zoom in and out of the map. If you have a mouse, you can use your scroll wheel to zoom in and out. If you are using a laptop and don’t have a mouse, you can zoom in and out using the scale bar in the upper left of the map window. Drag the bar left and right by holding your left mouse down and moving the bar left or right with your mouse.
de: Es gibt verschiedene Arten, in die Karte hinein- oder hinauszuzoomen. Mit einer Maus ist das Mausrad hierfür nutzbar. Bei einem Notebook ohne Maus kannst Du den Maßstabsregler links oben in der Kartenansicht verwenden. Benutze die linke Maustaste, um den Regler zu fassen und verschiebe ihn bei gedrückt gehaltener Taste.

source: Look at the sample map. There a few different types of objects here. There is a river, a forest, some buildings, several roads, and a couple of shops. To select an object, click on it with your left mouse button.
de: Sieh' Dir die Beispielkarte an. Es gibt eine Reihe verschiedener Objekte: Einen Fluss, einen Wald, einige Gebäude und Straßen sowie ein paar Geschäfte. Um ein Objekt auszuwählen, klicke es mit der linken Maustaste an.

source: Points, Lines, and Shapes
de: Punkte, Linien und Flächen

source: As you click different objects on the sample map, notice that there are three different types of objects on the map. There are points, lines, and shapes.
de: Beachte beim Auswählen verschiedener Objekte auf der Karte, dass es drei Typen von Objekten gibt: Punkte, Linien und Flächen.

source: Points are a single location, represented by symbols. On this sample map, there are two points, a shoe shop and a supermarket. The shoe shop is represented by a shoe symbol, and the market is represented by a shopping cart.
de: Punkte beschreiben eine einzelne Position, die durch Symbole dargestellt wird. Auf dieser Beispielkarte befinden sich zwei Punkte, ein Schuhgeschäft und ein Supermarkt. Das Schuhgeschäft wird durch ein Schuhsymbol und der Markt durch einen Einkaufswagen dargestellt.

source: There are several lines on the map as well, which represent roads. If you look closely you will see that within the lines, there are points as well. These points don’t have any symbols or other information associated with them, but they help to define where the line is located.
de: Es gibt auch mehrere Linien auf der Karte, die Straßen darstellen. Wenn man genau hinschaut, wird man sehen, dass es innerhalb der Linien auch Punkte gibt. Diesen Punkten sind keine Symbole oder andere Informationen zugeordnet, aber sie helfen zu definieren, wo sich die Linie befindet.

source: Lastly, there are numerous shapes on the sample map, representing different places - a forest, a river, a park, and buildings. A shape is used to represent an area, like a field or a building. A shape is exactly like a line - the only difference is that the line begins at the same point where it ends.
de: Schließlich gibt es zahlreiche Formen auf der Beispielkarte, die verschiedene Orte darstellen – einen Wald, einen Fluss, einen Park und Gebäude. Eine Form wird verwendet, um einen Bereich darzustellen, z. B. ein Feld oder ein Gebäude. Eine Form ist genau wie eine Linie – der einzige Unterschied ist, dass die Linie an der gleichen Stelle beginnt, an der sie endet.

source: It's easy to think of a map as containing these three basic types of objects - points, lines, and shapes. In OpenStreetMap there is special terminology which you will come to learn as you progress. In OSM, points are actually called **nodes**, and lines are called **ways**. A shape is called a **closed way** because it is just a line that ends at the same point where it begins.
de: Es ist leicht, sich eine Karte so vorzustellen, dass sie diese drei grundlegenden Objekttypen enthält – Punkte, Linien und Formen. In OpenStreetMap gibt es eine spezielle Terminologie, die Du kennenlernen wirst. In OSM werden Punkte eigentlich **Knoten** und Linien als **Weg** bezeichnet. Eine Form wird als **geschlossener Weg** bezeichnet, da es sich nur um eine Linie handelt, die an derselben Stelle endet, an der sie beginnt.

source: You may notice that when you select an object, a list appears to the right of the map in a window called “Properties”. These are known as tags. Tags are information that is tied to a point, line or shape that describes what it is. We’ll learn more about tags in a later chapter. For now all you need to know is that this information helps describe whether our object is a forest, a river, a building, or something else.
de: Du wirst feststellen, dass bei der Auswahl eines Objekts rechts neben der Karte in einem Fenster mit dem Namen "Merkmale" eine Liste angezeigt wird. Diese werden als Tags bezeichnet. Tags sind Informationen, die an einen Punkt, einer Linie oder eine Form gebunden sind und beschreiben, worum es sich handelt. Weitere Informationen zu Tags finden Sie in einem späteren Kapitel. Im Moment müssen Sie nur wissen, dass diese Informationen helfen zu beschreiben, ob unser Objekt ein Wald, ein Fluss, ein Gebäude oder etwas anderes ist.

source: Think about drawing a map by hand, and how you are also drawing points, lines, and shapes. What other places are best represented by points? Lines? Shapes?
de: Überlege wie es ist, eine Karte von Hand zu zeichnen und wie Du auch dort Punkte, Linien und Formen zeichnest. Welche anderen Orte werden am besten durch Punkte, Linien oder Formen dargestellt?

source: Changing Objects
de: Ändern von Objekten

source: Select the forest on the left side of the map. Be sure to click on the line around the forest, not one of the points on the line. Now hold your left mouse button down and drag your mouse. You should be able to move the forest to a new location on the map.
de: Wähle den Wald auf der linken Seite der Karte aus. Achte darauf, auf die Linie um den Wald zu klicken, nicht auf einen der Punkte auf der Linie. Halte nun die linke Maustaste gedrückt und bewege die Maus. Du solltest nun in der Lage sein, den Wald an eine neue Position auf der Karte zu verschieben.

source: Click on one of the points on the line around the forest. Hold your left mouse button down and drag your mouse. You should be able to move the point. This is how you can change the shape of an object, or move a point.
de: Klicke auf einen der Punkte auf der Linie rund um den Wald. Halte die linke Maustaste gedrückt und bewege die Maus. Du solltest in der Lage sein, den Punkt zu bewegen. Auf diese Weise kannst Du die Form eines Objekts ändern oder einen Punkt verschieben.

source: Drawing
de: Zeichnen

source: On the left side of JOSM is a column of buttons. Many of these buttons open new windows on the right side that provide more information about the map. The most important buttons, however, are at the top of these column. These buttons change what you can do with your mouse.
de: Auf der linken Seite von JOSM befindet sich eine Spalte von Schaltflächen. Viele dieser Schaltflächen öffnen neue Fenster auf der rechten Seite, welche weitere Informationen zur Karte bereitstellen. Die wichtigsten Schaltflächen befinden sich jedoch oben in dieser Spalte. Diese Schaltflächen ändern, was Sie mit der Maus tun können.

source: The top buttons in this column are the ones you will use the most. They are used for selecting objects and for drawing new ones.
de: Die oberen Schaltflächen in dieser Spalte sind die, die Du am meisten verwenden wirst. Sie werden zum Auswählen von Objekten und zum Zeichnen neuer Objekte verwendet.

source: Until now, you have been using the Select tool, which looks like this:
de: Bisher hast Du das Auswahl-Werkzeug verwendet, das wie folgt aussieht:

source: Before you draw, you need to make sure that nothing is selected. Click in the black space on the map, where it is empty, to make sure nothing is selected.
de: Vor dem Zeichnen musst Du sicherstellen, dass nichts ausgewählt ist. Klicke in den schwarzen leeren Bereich auf der Karte, um sicherzustellen, dass nichts ausgewählt ist.

source: Click on the second button, the Draw tool.
de: Klicke auf das zweite Werkzeug, das Zeichenwerkzeug.

source: Find an empty area on the map, and double-click with your mouse. This will draw a single point.
de: Suche einen leeren Bereich auf der Karte, und doppelklicke mit der Maus. Dadurch wird ein einziger Punkt erstellt.

source: To draw a line, single-click with your mouse. Move your mouse and click again. Continue until you are happy with your line. To end the line, double-click your mouse.
de: Um eine Linie zu zeichnen, klicke Sie mit der Maus. Bewege die Maus und klicke erneut. Fahre fort, bis Du mit der Linie zufrieden bist. Um die Zeile zu beenden, doppelklicke mit der Maus.

source: Draw a shape the same way that you draw a line, but finish the shape by double-clicking on the point where you started the line.
de: Zeichne eine Form auf die gleiche Weise, wie eine Linie, aber beende die Form, indem Du auf den Punkt doppelklickst, an dem Du die Linie gestartet hast.

source: Add Presets
de: Vorlagen hinzufügen

source: Now we know how to draw points, lines and shapes, but we still haven’t defined what they represent. We want to be able to say that our points are shops, schools, or something else, and whether our shapes are fields, buildings, or something else.
de: Jetzt wissen wir, wie man Punkte, Linien und Formen zeichnet, aber wir haben immer noch nicht definiert, was sie darstellen. Wir wollen sagen können, dass unsere Punkte Geschäfte, Schulen oder etwas anderes sind und ob unsere Formen Felder, Gebäude oder etwas anderes sind.

source: Click on the Select tool, in the column of buttons on the left.
de: Klicke auf das Werkzeug "Auswählen" in der Arbeitswerkzeugleiste auf der linken Seite.

source: Select one of the objects that you drew with the Draw tool. On the top menu, click “Presets”. Move your mouse through the sub-menu to the type of location you would like to define.
de: Wähle eines der Objekte aus, die Du mit dem Werkzeug Zeichnen gezeichnet hast. Klicke im oberen Menü auf "Vorlagen". Bewege die Maus durch das Untermenü zu dem Eintrag, den Du definieren möchtest.

source: When you click on a preset, a form will pop up asking you for more information. You do not have to fill in every field, but you may wish to add some of the important fields, such as the name of the object.
de: Wenn Du auf eine Vorlage klickst erscheint ein Formular, in dem Du nach weiteren Informationen gefragt wirst. Du musst nicht jedes Feld ausfüllen, aber kannst aber einige der wichtigen Felder hinzufügen, z. B. den Namen des Objekts.

source: When you are finished entering the information, click “Apply Preset”. If everything went well, your point, line, or shape should change colors or show a symbol. This is because you have defined what it is.
de: Wenn Du mit der Eingabe der Informationen fertig bist, wähle "Vorlage anwenden". Wenn alles gut gelaufen ist, sollte das bearbeitete Objekt (Punkt, Linie oder Form) die Farbe ändern oder ein Symbol anzeigen. Das liegt daran, dass Du definiert hast, um was es sich dabei handelt.

source: Draw Your Own Map
de: Erstelle Deine eigene Karte

source: Now let’s draw a map in order to practice the techniques you have learned. You may wish to redraw the map that you drew on paper previously.
de: Zeichnen wir nun eine Karte, um die Techniken zu üben, die Du gelernt hast. Du magst vielleicht eine Karte, die Du zuvor auf Papier gezeichnet hast, neu zeichnen.

source: Drag the map away from the sample map. Hold the right mouse button and drag your mouse, until you have a nice empty area to draw on.
de: Bewege die Karte von der Beispielkarte weg. Halte die rechte Maustaste gedrückt und bewege die Maus, bis Du einen schönen leeren Bereich zum Zeichnen hast.

source: Use the Draw tool to create points, lines, and shapes. Describe what your objects are by selecting from the Presets menu.
de: Benutze das Zeichnen-Werkzeug, um Punkte, Linien und Formen zu erstellen. Beschreibe, was Deine Objekte sind, indem Du aus dem Menü "Vorlagen" auswählst.

source: When you are finished, you should have your own map, similar to the sample map that we opened in sample.osm.
de: Wenn Du fertig bist solltest Du eine eigene Karte haben, ähnlich der Beispielkarte, die wir in der Datei "sample.osm" geöffnet haben.

source: Remove the sample layer
de: Entfernen der Beispielebene

source: Once you feel comfortable with these basic editing techniques you might want to turn your attention to mapping real features.
de: Sobald Du Dich mit diesen grundlegenden Bearbeitungstechniken wohl fühlst, möchtest Du Dich vielleicht dem Kartieren wirklicher Dinge widmen.

source: *It is very important that you first remove the layer with the sample data. These data are fictitious and must not be uploaded to the OpenStreetMap database (newer JOSM releases automatically prevent this).*
de: *Es ist sehr wichtig, dass Du zuerst die Ebene mit den Beispieldaten entfernst. Diese Daten sind fiktiv und dürfen nicht in die OpenStreetMap-Datenbank hochgeladen werden (neuere JOSM-Releases verhindern dies automatisch).*

source: In the Layers window on the upper right of the screen select the sample.osm layer. Then click on the trash can icon in the lower right corner of that window. Alternatively you can choose delete from the context menu of the layer.
de: Wähle im Fenster Ebenen oben rechts auf dem Bildschirm die Ebene sample.osm aus. Klicke dann auf das Papierkorbsymbol in der unteren rechten Ecke dieses Fensters. Alternativ kannst Du aus dem Kontextmenü der Ebene "Entfernen" auswählen.

source: What Next?
de: Was nun?

source: Try the LearnOSM documentation, from which this quickstart was derived: http://learnosm.org/en/josm/start-josm/
de: Probiere die LearnOSM-Dokumentation aus, aus der dieser Schnellstart abgeleitet wurde: http://learnosm.org/de/josm/start-josm/

source: In order to continue editing you first need to download real data. This is explained in the next chapter: http://learnosm.org/en/josm/more-about-josm/
de: Um die Bearbeitung fortzusetzen, musst Du zunächst echte Daten herunterladen. Dies wird im nächsten Kapitel erläutert: http://learnosm.org/de/josm/more-about-josm/
