Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapbender_quickstart.po
Languages: hu

source: Mapbender Quickstart
hu: Mapbender gyorstalpaló

source: Mapbender is a web based geoportal framework to publish, register, view, navigate, monitor and grant secure access to spatial data infrastructure services.
hu: A Mapbender egy web alapú geoportál keretrendszer téradat infrastruktúra szolgáltatások publikálására, regisztrálására, megtekintésére, navigálásra, monitorozására és biztonságos hozzáférés biztosítására.

source: You will need nothing but a standard web browser for this quickstart.
hu: Ehhez a gyorstalpalóhoz nem lesz másra szüksége mint egy szabványos web böngészőre.

source: This Quick Start describes how to:
hu: Ez a gyorstalpaló leírja:

source: start Mapbender
hu: Mapbender indítása

source: create an application
hu: egy alkalmazás létrehozása

source: load a Web Map Service (OGC WMS)
hu: egy Web Map Service (OGC WMS) betöltése

source: configure WMS
hu: WMS konfigurálás

source: create an individual application
hu: egyedi alkalmazás létrehozása

source: create a user and a group and assign applications to them
hu: egy felhasználó és egy csoport létrehozása és összerendelésük alkalmazásokkal

source: This is how a Mapbender application can look like:
hu: Ez ahogy egy Mapbender alkalmazás kinéz:

source: Installation
hu: Telepítés

source: For the installation of Mapbender have a look at https://doc.mapbender.org/en/installation.html.
hu: A Mapbender telepítéséhez vessen egy pillantást a https://doc.mapbender.org/en/installation.html oldalra.

source: Start Mapbender
hu: Mapbender indítás

source: Choose :menuselection:`Geospatial --> Browser Clients --> Mapbender` from the start menu or visit http://localhost/mapbender/app.php
hu: Válassza a :menuselection:`Geospatial --> Browser Clients --> Mapbender`-t a start menüből vagy látogassa meg a http://localhost/mapbender/app.php oldalt.

source: The application will take a few moments to start up
hu: Az alkalmazás néhány pillanat múlva elindul

source: If you have any difficulties running Mapbender, please check whether your Apache web server and your PostgreSQL database are running. Or if you use SQLite as database whether you have write access to the file.
hu: Ha bármilyen nehézség adódik a Mapbender futtatásában, kérjük ellenőrizze, hogy az Apache web szervere és a PostgreSQL adatbázisa fut-e. Vagy ha SQLite adatbázist használ van írási joga a fájlhoz.

source: Start Mapbender in the developer mode app_dev.php
hu: Indítsa a Mapbender-t fejlesztő módban app_dev.php

source: Symfony offers a developer mode with lot of information about your application (logging, exceptions, database queries, memory usage, time and more). This mode is only available from localhost.
hu: Symfony egy fejlesztői módot is kínál sok információval az alkalmazásáról (naplózás, kivételek, adatbázis lekérdezések, memória használat, idő és továbbiak). Ez az mód csak a localhost-ról érhető el.

source: Start the developer mode: http://localhost/mapbender/app_dev.php
hu: Indítsa a fejlesztő módot: http://localhost/mapbender/app_dev.php

source: Have a look at the information that is offered in the developer mode.
hu: Vessen egy pillantást az információra, amit a fejlesztő mód kínál.

source: Welcome page
hu: Üdvözlő lap

source: The Welcome page lists applications that are public and can be used by all users. The applications are listed with a screenshot, a title and a description.
hu: Az üdvözlő lap a nyilvános és bármely felhasználó által használható alkalmazásokat listázza. Az alkalmazások egy képernyő képpel, egy címmel és egy leírással jelennek meg.

source: You can open an application by click on the title, the screenshot or the start button.
hu: Egy alkalmazást megnyithat a címre, a képernyőképre vagy a start gombra kattintással.

source: Before you can administrate with Mapbender you have to login to get access to the administration.
hu: Mielőtt adminisztrálni tudna a Mapbenderrel be kell jelentkeznie, hogy hozzáférjen az adminisztrációhoz.

source: Click on Login at right-top to open the login page.
hu: Kattintson a Login-ra a jobb felső részen a bejelentkező oldal megnyitásához.

source: You can login with the user that was generated on installation. It can be :guilabel:`root` and password :guilabel:`root` (This is the default user and password that you get after installation of Mapbender on OSGeoLive. Please change the root password if you want to run a productive environment. Please don't delete the user :guilabel:`root`.).
hu: Be tud jelentkezni a telepítéskor generált felhasználóval. Ez :guilabel:`root` lehet és a jelszó :guilabel:`root` (Ez az alapértelmezett felhasználó és jelszó, melyet az OSGeoLive-ra telepített Mapbender-hez kap. Kérjük módosítsa a root jelszót, ha éles környezetben akarja futtatni. Kérjük ne törölje a :guilabel:`root` felhasználót.).

source: After successful login you are directed to the :guilabel:`Mapbender administration`.
hu: A sikeres bejelentkezés után a :guilabel:`Mapbender administration`-hoz irányítják.

source: Application overview
hu: Alkalmazás áttekintés

source: After the login you are directed to the :guilabel:`Applications` with a list of applications you are allowed to access.
hu: A bejelentkezés után a :guilabel:`Applications`-hoz irányítják, az ön számára elérhető alkalmazások listájával.

source: The Application overview provides the following functionality:
hu: Az alkalmazás áttekintés a következő funkcionalitást biztosítja:

source: title and description
hu: cím és leírás

source: screenshot for the application (if provided)
hu: képernyő kép az alkalmazáshoz (ha megadták)

source: link to the application
hu: link az alkalmazáshoz

source: button to duplicate the application
hu: gomb az alkalmazás duplikálásához

source: button to edit the application
hu: gomb az alkalmazás szerkesztéséhez

source: button to publish/unpublish the application
hu: gomb az alkalmazás publikálásához/visszavonásához

source: button to delete the application
hu: gomb az alkalmazás törléséhez

source: button to create a new application
hu: gomb új alkalmazás készítéséhez

source: with the filter textfield you can search for applications
hu: a szűrő szövegmezővel alkalmazásokra kereshet

source: Create an individual application
hu: Egyedi alkalmazás létrehozása

source: Create a new application by providing basic information about your application. After that you use the edit mode to add elements, layers and security.
hu: Hozzon létre egy új alkalmazást az alap információk megadásával az alkalmazásáról. Ezután a szerkesztő módot használhatja elemek, rétegek és biztonság hozzáadásához.

source: choose :menuselection:`Applications --> New Application`
hu: válassza a :menuselection:`Applications --> New Application`-t

source: define a title and description for your application
hu: adjon meg egy címet és leírást az alkalmazásához

source: define an URL title which will be used in the URL to open the application. It can be the same as the title
hu: adjon meg egy URL címet, melyet az alkalmazás megnyitásához használunk az URL-ben, Ez ugyanaz lehet mint a cím.

source: upload an image file as screenshot for the application overview
hu: töltsön fel egy kép fájlt mint képernyőképet az alkalmazás összefoglalóhoz

source: choose a template for your application
hu: válasszon egy sablont az alkalmazásához

source: choose the button **Create** to create the application
hu: válassza a **Create** gombot az alkalmazás létrehozásához

source: click the :menuselection:`Edit-Button` at the new application to edit the application
hu: kattintson a :menuselection:`Edit-Button`-ra az új alkalmazásnál az alkalmazás szerkesztéséhez

source: your application is set up. Now you need a WMS to be displayed in your application. This will be described in the section **WMS Management**.
hu: az alkalmazását beállította. Most egy az alkalmazásában megjelenített WMS-re van szüksége. Ezt a **WMS kezelés** fejezetben írjuk le.

source: Please note, that the style-, icon- and layout configuration has to be done in css- and twig-files at the moment. Read more about template generation at https://doc.mapbender.org/en/customization/templates.html.
hu: Kérjük vegye figyelembe, hogy a stílus, ikon és az elrendezés konfiguráció jelenleg css és twig fájlokban készíthető el. Olvasson többet a sablon generálásról a https://doc.mapbender.org/en/customization/templates.html címen.

source: Copy or rename an application
hu: Alkalmazás másolása vagy átnevezése

source: You also can create a new application by copying an existing application. Every application with write access can be copied. It provides a button to duplicate the application with all the services. The new application will get a derived name which can be changed in the next step.
hu: Új alkalmazást létrehozhat létező alkalmazások lemásolásával. Minden írási joggal rendelkező alkalmazás lemásolható. Egy gomb biztosítja az alkalmazás és az összes szolgáltatás duplikálását. Az új alkalmazás egy származtatott nevet kap, melyet megváltoztathatunk a következő lépésben.

source: Delete an application
hu: Alkalmazás törlése

source: You can delete an application from the menu item :menuselection:`Applications` with the :menuselection:`x-button`.
hu: Törölheti az alkalmazást a menüelemből :menuselection:`Applications` az :menuselection:`x-gombbal`.

source: Export / Import applications and sources
hu: Alkalmazás és források Export/Importja

source: You can export applications as JSON or YAML with :menuselection:`Applications --> Export`. You can choose one or more applications to export and you can also export the sources which are published in the applications.
hu: Exportálhatja az alkalmazásokat mint JSON vagy YAML az :menuselection:`Applications --> Export`-tal. Egy vagy több exportálandó alkalmazást választhat és az alkalmazásban publikált forrásokat is exportálhatja.

source: The exportfile contains all the definitions of the application/s (sources) and can be imported via :menuselection:`Applications --> Import` in another Mapbender3 installation or in the same installation.
hu: Az export fájl az alkalmazás (források) minden definícióját tartalmazza és az :menuselection:`Applications --> Import`-on keresztül egy másik vagy ugyan ebbe a Mapbender3 telepítésbe importálható.

source: Management of Data Sources
hu: Adatforrások kezelése

source: Mapbender can handle OGC WMS. The administration provides an administration interface for the sources (at the moment only WMS).
hu: A Mapbender képes OGC WMS kezelésére. Az adminisztráció biztosít egy adminisztrációs interfészt a forrásokhoz (jelenleg csak WMS).

source: Service Repository overview
hu: Szolgáltatás tárház összefoglaló

source: Go to :guilabel:`Services` and have a look at the Service repository.
hu: Menjen a :guilabel:`Services`-re és vessen egy pillantást a Service tárházra.

source: You get an overview on the Sources that are loaded in your Mapbender.
hu: Egy összefoglalást kap a Mapbenderébe betöltött forrásokról.

source: Type, Title, Description offer first information about the services.
hu: Típus, cím, leírás adják az elsődleges információt a szolgáltatásról.

source: On click on the button :menuselection:`View-Button` you get further information about the source.
hu: A :menuselection:`View-Button`-ra kattintva további információt kap a forrásról.

source: With the button :menuselection:`Delete-Button` you can delete the source from your repository.
hu: A :menuselection:`Delete-Button`-al törölheti a forrást a tárházából.

source: Loading Web Map Services
hu: Web térkép szolgáltatások betöltése

source: You can load OGC Web Map Services (WMS) to your application.
hu: Betölthet OGC Web Map Szolgáltatásokat (WMS) az alkalmazásába.

source: A WMS returns an XML-file when the getCapabilities document is requested. This information is parsed by Mapbender and Mapbender gets all the necessary information about the service from this XML
hu: A WMS egy XML fájlt ad vissza, amikor a getCapabilities dokumentumot kérik. Ez az információt értelmező a Mapbender és minden szükséges szükséges információt megkap a szolgáltatásról ebből az XML-ből.

source: You should first check the Capabilities document in your browser before you try to load it with Mapbender
hu: Először ellenőriznie kell a Capabilities dokumentumot a böngészőjében mielőtt megpróbálja betölteni a Mapbender-be.

source: Choose menu item :menuselection:`Services --> Add Service` or use the +-Button. Link to the WMS getCapabilities URL in the text field :menuselection:`Serviceurl`.
hu: Válassza a :menuselection:`Services --> Add Service` menüelemet vagy használja a +- gombot A következő mezőbe adja meg a WMS GetCapabilities URL-t :menuselection:`Serviceurl`.

source: Enter username and password if your service needs authentication.
hu: Adja mg felhasználó nevét és jelszavát, ha a szolgáltatás hitelesítést kér.

source: Hit **Load** to load the Service to the repository.
hu: Kattintson a **Load**-ra a szolgáltatás betöltéséhez a tárházba.

source: After successful registration of the service Mapbender will display an overview on the information that was provided by the service.
hu: A szolgáltatás sikeres regisztrációja után a Mapbender egy összefoglalót jelenít meg az adatokról, melyeket a szolgáltatás biztosít.

source: Here is a example WMS:
hu: Itt van egy WMS példa:

source: Add Service to Application
hu: Szolgáltatás hozzáadása az alkalmazáshoz

source: After the successful upload of a WMS you want to add your WMS to an application.
hu: Egy WMS sikeres feltöltése után a WMS-ét hozzá fogja adni egy alkalmazáshoz.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> Edit-Button`.
hu: Válassza a :menuselection:`Applications --> edit-Button --> Layers --> Edit-Button`-t.

source: Click on the :menuselection:`+-button` to add a layerset, which represents a collection of layers (a possible name could be main)
hu: Kattintson a :menuselection:`+-gombra` egy rétegcsoport hozzáadásához, mely a rétegek egy csoportját reprezentálja (egy lehetséges név main)

source: Now you can add layer to the layerset
hu: Most réteget adhat hozzá a réteg csoporthoz

source: Click on the :menuselection:`+-button` at your new layerset to add a Service.
hu: Kattintson a :menuselection:`+-gombra` az új rétegcsoportjában egy szolgáltatás hozzáadásához.

source: You can change the order of the Services in your application by drag & drop.
hu: Húzással és elengedéssel az alkalmazásán belül módosíthatja a szolgáltatások sorrendjét.

source: Configure your WMS
hu: WMS konfigurálása

source: You can configure the WMS for your specific application. Maybe you don't want to provide all layers or you want to change the order or titles of the layer or disable the feature info or change the maxscale for a layer.
hu: Konfigurálhatja a WMS-t az egyedi alkalmazásához. Lehet, hogy nem akarja az összes réteget kínálni vagy módosítani szeretné a rétegek sorrendjét vagy címét vagy az elem infót le akarja tiltani vagy a max méretarányt akarja módosítani.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> edit-Button` to configure the Service Instance.
hu: Válassza :menuselection:`Applications --> edit-Button --> Layers --> edit-Button` a szolgáltatás példány konfigurálásához.

source: You will see a table with the layers of the Service.
hu: Egy táblázatot lát a szolgáltatás rétegeivel.

source: You can change the order of the layers via drag & drop
hu: Módosíthatja a rétegek sorrendjét húzással

source: Service configuration
hu: Szolgáltatás konfiguráció

source: format - choose the format for getMap-Requests
hu: format - válasszon formátumot a getMap kéréshez

source: infoformat - choose the format for getFeatureInfo-Requests
hu: infoformat - válaszon formátumot a getFeatureInfo kéréshez

source: exceptionformat - choose the format for exceptions
hu: exceptionformat - válasszon formátumot a kivételekhez

source: opacity - choose opacity in percent
hu: opacity - válasszon százalékot az átláthatatlanságra

source: visible - default on. Service should be visible
hu: visible - alapértelmezett értéke bekapcsolt. A szolgáltatás legyen látható

source: basesource - activated for services that should be administrated by BaseSourceSwitcher
hu: basesource - azokra a szolgáltatásokra aktív melyek adminisztrációját a BaseSourceSwitcher-rel végzik

source: proxy - if active the service will be requested by Mapbender and not directly
hu: proxy - ha aktív, akkor nem közvetlenül, hanem Mapbender-en keresztül kérjük a szolgáltatást

source: transparency - default is active, the source is without a transparent background if it is deactivated (getMap-Request with TRANSPARENT=FALSE)
hu: transparency - alapértelmezés szerint aktív, ha nem aktív a forrás háttere nem lesz átlátszó (getMap kérés TRANSPARENT=FALSE-al)

source: tiled - you can request a WMS in tiles, default is not tiled (may be a good choice if your map is very big and the WMS service does not support the width/height)
hu: tiled - kérheti a WMS-t csempékben, az alapértelmezés nem csempés (egy jó választás lehet, ha a térképe nagyon nagy és a WMS nem támogatja a szélesség/magasságot)

source: Layer ordering - layer ordering can get switched in the application
hu: Layer ordering - a réteg rendezés bekapcsolható az alkalmazásban

source: BBOX factor - This parameter is valid for non-tiled WMS services. You can specify the size of the returned map-image. A value greater than 1 will request a bigger map-image. Default: 1.25, can be set to 1.
hu: BBOX factor -Ez a paraméter a nem csempe alapú WMS szolgáltatásokhoz használható. Megadhatja a visszaadott térkép kép méretét. 1-nél nagyobb érték egy nagyobb képet kér le. Alapértelmezett érték: 1.25, 1-re állítható.

source: tile buffer - This parameter is valid for tiles services and specifies if additional tiles should be requested. If the user pans the map, these tiles are already downloaded and visible. The higher the value the more tiles are requested. Default: 0
hu: tile buffer - Ez a paraméter csempe szolgáltatásokhoz használható és megaja, hogy további csempéket kell lekérni. Ha a felhasználó eltolja a térképet ezek a csempéket már letöltötte és láthatók. Minél nagyobb az érték annál több csempét tölt le. Alapértelmezett érték: 0

source: Layer configuration
hu: Réteg konfiguráciő

source: title - layer title from Service information
hu: title - réteg cím a szolgáltatásinformációhoz

source: active (on/off) - enable/disable a layer for this individual application
hu: active (on/off) - a rétegengedélyezése/tiltása ehhez az egyedi alkalmazáshoz

source: select on - selectable in geodata explorer
hu: select on - szelektálható a geo-adat böngészőben

source: select allow - layer is active when the application starts
hu: select allow - a réteg aktív amikor az alkalmazás elindul

source: info on - layer provides feature info requests, info default activates the feature info functionality
hu: info on - a réteg elem infó kéréseket kiszolgálja, alapértelmezett info aktiválja az elem infó funkcionalitást

source: info allow - feature info is possible for this layer
hu: info allow - elem információ elérhető a rétegre

source: minscale / maxscale - the scale range in which the layer should be displayed, 0 means no scale limitation
hu: min/max méretarány - a méretarány tartomány melyben a réteget megjelenítjük, 0 esetén nincs méretarány korlátozás

source: toggle - open folder on start of the application
hu: toggle - mappa megnyitása az alkalmazás indításakor

source: reorder - allows to reorder the layers with drag & drop while using the application
hu: átrendezés - lehetővé teszi a rétegek átrendezését az alkalmazás használata közben, húzással és elengedéssel

source: ... -> opens a dialog with more information
hu: ... -> párbeszédablakot nyit további információkkal

source: name - layer name of the service information (for getMap-Requests)
hu: name - rétegnév a szolgáltatás információból (getMap kérésekhez)

source: style - if a WMS provides more than one style you can choose a different style than the default style
hu: style - ha a WMS több mint egy stílust kínál , akkor az alapértelmezettől eltérő stílust választhat

source: Add Elements to your application
hu: Elemek hozzáadása az alkalmazásához

source: Mapbender offers a set of elements. You can add the elements to your application. You have different regions (Toolbar, Sidepane, Content, Footer) to which you can add elements.
hu: A Mapbender az elemeknek egy halmazát kínálja. Az elemeket hozzáadhatja az alkalmazásához. Különböző régiókkal rendelkezik (Toolbar, Sidepane, Content, Footer), melyekhez elemeket adhat hozzá.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> Button +` to get an overview over the elements Mapbender3 provides.
hu: Válassza a :menuselection:`Applications --> edit-Button --> Layers --> Button +`-t egy összefoglalóhoz a Mapbender3 által biztosított elemekről.

source: Choose an element from the list.
hu: Válasszon egy elemet a listából.

source: Notice that you have different areas in your application. Make sure to add the element to a region that makes sense.
hu: Vegye észre, hogy különböző területekkel rendelkezik az alkalmazásában. Győződjön meg róla, hogy az elemet olyan területhez adja aminek értelme van.

source: Configure the element. Notice: When you select an element for example **map** you see that the element has a set of attributes. Each element offers individual attributes for configuration.
hu: Konfigurálja az elemet. Megjegyzés: amikor egy elemet kiválaszt, például a **térképet** látja, hogy az elemnek attribútumai vannak. Minden elem egyedi tulajdonságokat kínál a konfiguráláshoz.

source: You can change the position of the element via drag & drop
hu: Az elemek sorrendjét húzással és elengedéssel megváltoztathatja

source: Have a look at your application. Open your application from :menuselection:`Applications --> Applications Overview`
hu: Vessen egy pillantást az alkalmazására. Nyissa meg az alkalmazását :menuselection:`Applications --> Applications Overview`

source: Now you should get an idea how easy it is to change a Mapbender application without changes in the code.
hu: Most már elképzelése lehet, milyen egyszerű egy Mapbender alkalmazás megváltoztatása a kód megváltoztatása nélkül.

source: Examples for elements Mapbender offers:
hu: Példák az elemekre, melyeket a Mapbender kínál:

source: Activity Indicator
hu: Aktivitás-jelző

source: BaseSourceSwitcher
hu: Bazesourceswitcher

source: Button
hu: Gomb

source: Coordinates Display
hu: Koordináta megjelenítés

source: Coordinate Utility
hu: Koordináta segédprogram

source: Copyright
hu: Szerzői jog

source: Feature Info
hu: Elem infó

source: GPS-Position
hu: GPS pozíció

source: Legend
hu: Jelmagyarázat

source: Layertree - Table of Content
hu: Réteg fa - tartalomjegyzék

source: Map
hu: Térkép

source: Navigation Toolbar (Zoombar)
hu: Navigáció eszközsor (Zoombar)

source: Overview
hu: Összefoglaló

source: Redlining
hu: Piros ceruzázás

source: Ruler Line/Area
hu: Vonalzó vonal/terület

source: Scale Selector
hu: Méretarány kiválasztó

source: ScaleBar
hu: Lépték

source: SimpleSearch - Search via Solr
hu: SimpleSearch - keresés Solr-al

source: SearchRouter - Seach via SQL
hu: SearchRouter - Keresés SQL-el

source: SRS Selector
hu: SRS szelektor

source: Spatial Reference System Selector (SRS Selector)
hu: Térbeli referencia rendszer választó (SRS szelektor)

source: WMS Loader
hu: WMS betöltő

source: WMC Editor
hu: WMC szerkesztő

source: WMC Loader
hu: WMC betöltő

source: WMC List
hu: WMC lista
