Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapbender_quickstart.po
Languages: hu

source: You find detailed information on every element in the `Mapbender element documentation <https://doc.mapbender.org/en/functions.html>`_.
hu: Részletes információt talál minden elemről a `Mapbender elem dokumentációban <https://doc.mapbender.org/en/functions.html>`_.

source: Try it yourself
hu: Próbálja ki egyedül

source: add a Map Element to the content of your application
hu: térkép elem hozzáadása az alkalmazás tartalmához

source: add a Layertree to the sidepane of your application
hu: rétegfa hozzáadása az alkalmazása oldal paneléhez

source: add a Legend to the sidepane of your application
hu: jelmagyarázat hozzáadása az alkalmazása oldal paneléhez

source: add a print element to the content
hu: nyomtatás elem hozzáadása a tartalomhoz

source: add a button that opens the print to the top of your application
hu: gomb hozzáadása, mely a nyomtatást az alkalmazás fölött nyitja meg

source: add the Navigation Toolbar to the content
hu: Navigációs eszköztár hozzáadása a tartalomhoz

source: add an overview map to the content
hu: áttekintő térkép hozzáadása a tartalomhoz

source: add a Copyright and change the copyright text
hu: szerzői jog hozzáadása és a szerzői jog szöveg módosítása

source: add a Scales Selector and an SRS Selector to the footer
hu: méretarány választó és vetület választó hozzáadása a lábléchez

source: User and group management
hu: Felhasználó és csoport kezelés

source: An access to Mapbender requires authentication. Only public applications can be used by everyone.
hu: A Mapbender hozzáféréshez hitelesítésre van szükség. Bárki csak a nyilvános alkalmazásokat használhatja.

source: A user has permissions to access one or a set of applications and services.
hu: Egy felhasználónak hozzáférési joga van egy vagy több alkalmazáshoz és szolgáltatáshoz.

source: Create a user
hu: Felhasználó létrehozása

source: To create a user go to :guilabel:`New User` or click the :menuselection:`+-Button`.
hu: Egy felhasználó létrehozásához menjen a :guilabel:`New User`-re vagy kattintson a :menuselection:`+-gombra`.

source: Choose a name and a password for your user.
hu: Válasszon egy nevet és egy jelszót a felhasználóhoz.

source: Provide an email address for the user.
hu: Adjon meg egy email címet a felhasználóhoz.

source: Save your new user.
hu: Mentse az új felhasználót.

source: You can provide more information about the user in the tab :menuselection:`Profile`.
hu: További információt adhat meg a felhasználóról a :menuselection:`Profile` fülön.

source: Create a group
hu: Egy csoport létrehozása

source: Create a group by :guilabel:`New Group`.
hu: Hozzon létre csoportot a :guilabel:`New Group`-pal.

source: Define a name and a description for your group.
hu: Adja meg az új csoporthoz egy nevet és egy leírást.

source: Save your new group.
hu: Mentse az új csoportját.

source: Assign users to group
hu: Felhasználók hozzárendelése a csoporthoz

source: Assign a user to a group by :guilabel:`Users --> Groups`.
hu: Rendeljen egy felhasználót egy csoporthoz :guilabel:`Users --> Groups`.

source: Choose one or more users you want to add to the group at :menuselection:`Users`.
hu: Válasszon egy vagy több felhasználót akit hozzá akar adni a csoporthoz :menuselection:`Users`.

source: Assign a user by :menuselection:`Users --> Edit-Button--> Groups` to a group.
hu: Rendeljen hozzá egy felhasználót a csoporthoz :menuselection:`Users --> Edit-Button--> Groups`

source: Roles
hu: Szerepek

source: Mapbender provides different rights. They refer to the Symfony ACL System http://symfony.com/doc/2.8/cookbook/security/acl_advanced.html#built-in-permission-map
hu: A Mapbender különböző jogokat biztosít. Ezek a Symfony ACL System-hez http://symfony.com/doc/2.8/cookbook/security/acl_advanced.html#built-in-permission-map kapcsolódnak

source: view - Whether someone is allowed to view the object.
hu: view - ha valaki megtekintheti az objektumot.

source: edit - Whether someone is allowed to make changes to the object.
hu: edit - ha valaki módosíthatja az objektumot.

source: delete - Whether someone is allowed to delete the object.
hu: delete - ha valaki törölheti az objektumot.

source: operator - Whether someone is allowed to perform all of the above actions.
hu: operator - ha valaki az összes fenti műveletet végrehajthatja.

source: master - Whether someone is allowed to perform all of the above actions, and in addition is allowed to grant any of the above permissions to others.
hu: master - ha valaki az összes fenti műveletet végrehajthatja és még a jogosultságokat más felhasználóknak is megadhatja.

source: owner - Whether someone owns the object. An owner can perform any of the above actions and grant master and owner permissions.
hu: owner - ha valaki tulajdonosa az objektumnak. Egy tulajdonos az összes fenti műveletet végrehajthatja és master illetve owner jogokat is kiadhat.

source: Assign roles to a user by :menuselection:`Users --> Edit your User --> Security`.
hu: Rendeljen szerepet egy felhasználóhoz :menuselection:`Users --> Edit your User --> Security`.

source: Assign an Application to a User/Group
hu: Rendeljen egy alkalmazást egy felhasználóhoz/csoporthoz

source: Edit your application by :menuselection:`Application --> Edit-Button`.
hu: Szerkessze az alkalmazását :menuselection:`Application --> Edit-gomb`.

source: Choose :menuselection:`Security`
hu: Válassza a :menuselection:`Security`-t

source: Set permission like view edit delete operator master owner
hu: Állítsa be az engedélyeket úgymint view edit delete operator master owner

source: Assign a user/group to the application
hu: Rendeljen felhasználót/csoportot az alkalmazáshoz

source: Test your configuration!
hu: Tesztelje a konfigurációt!

source: Logout from Mapbender by :menuselection:`Logout`.
hu: Jelentkezzen ki a Mapbender-ből :menuselection:`Logout`.

source: Login as the new user
hu: Jelentkezzen be mint az új felhasználó.

source: Things to try
hu: Kipróbálandó dolgok

source: Here are some additional challenges for you to try:
hu: Itt van néhány további kipróbálandó kihívás önnek:

source: Try to load some WMS in your application. Try to configure your WMS.
hu: Próbáljon meg néhány WMS-t betölteni az alkalmazásába. Próbálja megkonfigurálni a WMS-ét.

source: Try to create an individual application.
hu: Próbáljon egy saját alkalmazást létrehozni.

source: What Next?
hu: Mi a következő?

source: This is only the first step on the road to using Mapbender. There is a lot more functionality you can try.
hu: Ez csak az első lépés a Mapbender használatának útján. Sokkal több funkcionalitása van, amit kipróbálhat.

source: Mapbender Website
hu: Mapbender honlap

source: You find tutorials at
hu: Itt talál oktatóanyagokat

source: Get involved in the project
hu: Vegyen részt a projektben
