Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapslicer_quickstart.po
Languages: hu

source: MapSlicer Quickstart
hu: MapSlicer gyorstalpaló

source: `MapSlicer <https://wiki.osgeo.org/wiki/MapSlicer>`_ provides a simple way of creating a set of tiles from any georeferenced map image. The tiles can then be presented as a georeferenced map overlay on a web server. It follows the `Open Source Geospatial Foundation's (OSGeo's) <http://www.osgeo.org/>`_ `Tile Map Service (TMS) <http://wiki.osgeo.org/wiki/Tile_Map_Service_Specification>`_ specification.
hu: A `MapSlicer <https://wiki.osgeo.org/wiki/MapSlicer>`_ egyszerű lehetőséget biztosít csempék létrehozására georeferált raszterekből. A csempéket ezután mint egy georeferált térkép réteget jeleníthetjük meg egy web szerveren. Az `Open Source Geospatial Foundation (OSGeo) <http://www.osgeo.org/>`_ `Tile Map Service (TMS) <http://wiki.osgeo.org/wiki/Tile_Map_Service_Specification>`_ specifikációját valósítja meg.

source: **Input options**: Any georeferenced image file, eg. a TIFF, JPEG from ArcGIS, QGIS.
hu: **Input options**: Tetszőleges georeferált kép fájl pl. TIFF, JPEG ArcGIS, QGIS szoftverekből.

source: **Output options**: A set of directories with tiled images which can be copied to a web server for presentation as a georeferenced overlay.
hu: **Output**: A könyvtárak egy csoportja a csempe képekkel, melyeket egy web szerverre másolhatunk egy georeferált rétegként történő megjelenítéshez.

source: **Strengths**: MapSlicer is simple, free, open-source software, with an easy wizard, described below, to guide through the options.
hu: **Erősségek**: MapSlicer egyszerű, szabad, nyílt forráskódú program egy könnyen használható varázslóval, melyet alább írunk le, hogy végigvezessük a beállításokon.

source: MapSlicer takes advantage of the fact that `Google Maps <http://maps.google.com/>`_ , `Microsoft Bing <http://maps.bing.com>`_ , `Yahoo Maps <http://maps.yahoo.com/>`_ , and other online mapping providers including `OpenStreetMap <http://www.openstreetmap.org/>`_ use the same projection and tiling profile and the tiles are therefore compatible. MapSlicer prepares tiles using this specification as an easy and quick way of preparing a georeferenced map in a mashup web page.
hu: A MapSlicer kihasználja azt a tényt, hogy a `Google Maps <http://maps.google.com/>` _, a `Microsoft Bing <http://maps.bing.com>` _, a `Yahoo Maps <http: // maps.yahoo.com/>`_ és más online térképszolgáltatók, beleértve az `OpenStreetMap <http://www.openstreetmap.org/>`_ -et, ugyanazt a vetületet és csempézési profilt használják, és a így a csempék kompatibilisek. A MapSlicer ezen a specifikációalapján készíti a csempéket, mint egy könnyű és gyors módszer a georeferált térkép készítésére mashup honlapon.

source: Start MapSlicer
hu: MapSlicer indítás

source: Start MapSlicer from the Geospatial menu, under the Spatial Tools sub-menu.
hu: Indítsa el a MapSlicer-t a GeoSpatial menüből, a Spatial Tools almenü alatt.

source: Select the **Tile Profile**. Choose *Image Based Tiles (raster)* for standard web publishing. Click *Continue*.
hu: Válassza a **Tile Profile**-t. Majd az *Image Based Tiles (raster)* a szabványos webes publikáláshoz. Kattintson a *Continue*-ra.

source: Choose the **Source Data Files**. Browse to select the raster image you want to tile. It is also possible to select a NODATA colour that will appear as transparent in the resulting image. Click *Continue*.
hu: Válassza a **Source Data Files**-t. Tallózzon a csempékre darabolandó raszterképhez. Lehetőség van a NODATA szín kiválasztására is, ez átlátszóként jelenik meg az eredmény képen. Kattintson a *Continue*-ra.

source: Specify the **Spatial Reference System / Coordinate System** of the image. Specify the id-number from the EPSG database. Click *Continue*.
hu: Adja meg a kép vetületi rendszerét **Spatial Reference System / Coordinate System**. Adja meg az azonosító számot az EPSG adatbázisból. Kattintson a *Continue*-ra

source: Specify details about the **Tile Pyramid**. The default settings for zoom levels and file format are often best. Click *Continue*.
hu: Adja meg a **Tile Pyramid** részletei. Az alapértelmezett beállítások a nagyítási szintekre és a fájl formátumra gyakran a legjobbak. Kattintson a *Continue*-ra.

source: Specify details about the **Destination folder and Addresses / URLs** for the tileset. If you do not know these, they can be added into the default *googlemaps.html* and *openlayers.html* files after tile generation. Click *Continue*.
hu: Adja meg a cél könyvtárat és címet (**Destination folder and Addresses / URLs**) a csempehalmazra. Ha nem ismeri ezeket, hozzáadhatók a csempegenerálás utána az alapértelmezett *googlemaps.html* és *openlayers.html* fájlokhoz. Kattintson a *Continue*-ra.

source: Tick the **Viewers that should be generated**. By default, a *openlayers.html* file is generated. Click *Continue*.
hu: Jelölje ki a **generálandó nézeteket**. Alapértelmezés szerint egy *openlayers.html* fájl jön létre. Kattintson a *Continue*-ra.

source: Specify the **Details for generating the Viewers**, such as the title, copyright notice, and API keys. If you do not know these, they can be added into the default *googlemaps.html / openlayers.html* files after tile generation. Click *Continue*.
hu: Adja meg a **Details for generating the Viewers** (részletek a nézegető generálásához), mint a cím, szerzői jog figyelmeztetés és API kulcsok. Ha nem tudja ezeket, utólag hozzáadhatók az alapértelmezett *googlemaps.html / openlayers.html* fájlokhoz a csempe generálás után. Kattintson a *Continue* gombra.

source: Click **Render** to start rendering the image.
hu: Kattintson a **Render** gombra a kezdéshez.

source: When complete, MapSlicer provides a link to the finished tileset.
hu: Amikor befejezte, a MapSlicer megadja a linket az elkészített csempekészletre.

source: Open the *openlayers.html* files in a web browser to view the tileset as an overlay on the live online map. To present this on the web, just copy the entire tileset and all subdirectories to a web server, and edit the googlemaps.html or openlayers.html files as required.
hu: Nyissa meg egy web böngészőben *openlayers.html* fájlt a csempekészlet megtekintéséhez egy elő on-line térképen. A weben történő megjelenítéshez másolja a teljes csempekészletet és minden alkönyvtárat egy web szerverre és módosítsa a googlemaps.html vagy openlayers.html fájlokat szükség szerint.

source: Using gdal2tiles to create a MBTiles database
hu: gdal2tiles használta egy MBTiles adatbázis létrehozására

source: MapSlicer is essentially a GUI frontend to the `gdal2tiles.py` script. An updated version of `gdal2tiles.py` is also present on the Live disc. The resulting tile trees created by these software can be used with the `mb-util` program to create an mbtiles database, for use with smartphone software like `Geopaparazzi <http://geopaparazzi.github.io/geopaparazzi/>`_.
hu: A MapSlicer alapvetően egy grafikus felület a `gdal2tiles.py` szkripthez. A `gdal2tiles.py` egy aktualizált változata is rajta van a Live lemezen. Ezzel a szoftverrel létrehozott eredmény csempe fák használhatók `mb-util` programmal, hogy mbcsempe adatbázist hozzon létre az okostelefon programokhoz mint a `Geopaparazzi <http://geopaparazzi.github.io/geopaparazzi/>`_.

source: To create an MBTiles SQLite database from the newly created tile tree, open a terminal, then
hu: Az újonnan létrehozott csempe fából egy MBTiles SQLite adatbázis létrehozásához nyisson meg egy terminált, majd

source: See `gdal2tiles.py --help` and `mb-util --help` for additional information on running these tools.
hu: Lásd `gdal2tiles.py --help` és `mb-util --help` további információkért ezen eszközök futtatásáról.
