Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/osgeolive_quickstart.po
Languages: pt_br

source: This Quick Start describes how to start OSGeoLive from a DVD or USB.
pt_br: Este Quickstart descreve como iniciar o OSGeoLive a partir de um DVD ou USB.

source: System Requirements
pt_br: Requisitos do Sistema

source: Your computer should have at least:
pt_br: Seu computador precisa ter no mínimo:

source: CPU: 1 GHz i686 or compatible (Intel/AMD)
pt_br: CPU: 1 GHz i686 ou compatível (Intel/AMD)

source: Hard Disk:
pt_br: HD:

source: None required if running directly from the DVD
pt_br: Não é requerido se você estiver rodando diretamente do DVD

source: |osgeolive-hdspace| if you wish to install the operating system.
pt_br: |osgeolive-hdspace| se você quiser instalar o sistema operacional.

source: Mouse: a 3-button mouse is useful, especially for Mac trackpad users.
pt_br: Mouse: um mouse com 3-botões é útil, especialmente para usuários de Mac trackpad.

source: Run:
pt_br: Rodando:

source: Source an OSGeoLive DVD, ISO available from: [:doc:`Download <../download>`] Put the DVD into your computer's CD drive, then reboot your computer.
pt_br: Insira o DVD com o OSGeoLive, o ISO está disponível em: [:doc:`Download <../download>`] Insira o DVD no drive do seu computador, então reinicie o computador.

source: If your computer is set to boot from CD (as is often the case) you should boot up into a Lubuntu system, with Geospatial applications installed. Otherwise you'll have to adjust the BIOS boot settings or press the boot menu button just after powering-up.
pt_br: Se o seu computador está configurado para iniciar a partir do DVD (frequentemente é o caso), seu computador iniciará uma distribuição Lubuntu, com as aplicações geoespaciais instaladas. Caso contrário, você irá precisar ajustar as configurações de inicialização da BIOS ou selecionar o menu de boot assim que o computador ligar.

source: Sit back while the system boots up.
pt_br: Espere enquanto o sistema está iniciando.

source: Try the many applications from the :menuselection:`Geospatial` menu.
pt_br: Teste as muitas aplicações que estão no menu :menuselection:`Geospatial` .

source: See Also:
pt_br: Também veja:

source: Getting started with Lubuntu and the LXDE desktop (which is used by OSGeoLive):
pt_br: Primeiros passos com Lubuntu e o LXDE desktop (o qual é usado pelo OSGeoLive):

source: https://help.ubuntu.com/community/Lubuntu/Documentation and http://wiki.lxde.org
pt_br: https://help.ubuntu.com/community/Lubuntu/Documentation e http://wiki.lxde.org

source: Getting started with the Ubuntu operating system:
pt_br: Primeiros passos com o sistema operacional Ubuntu:

source: `local eBook <file:///usr/local/share/doc/Getting_Started_with_Ubuntu_13.10.pdf>`_ and `extended online help <http://help.ubuntu.com/14.04/>`_
pt_br: `local eBook <file:///usr/local/share/doc/Getting_Started_with_Ubuntu_13.10.pdf>`_ e `extended online help <http://help.ubuntu.com/14.04/>`_
