Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/pycsw_quickstart.po
Languages: de

source: Running the tester application
de: Nutzung der Test-Anwendung

source: To run the pycsw tester, use the pycsw launcher from the Web Services group, or open Firefox and navigate to ``http://localhost/pycsw/tests/index.html``:
de: Zum Aufruf der pycsw-Test-Anwendung gehen Sie über den Menüeintrag pycsw unter Web Services oder öffnen Sie die Seite ``http://localhost/pycsw/tests/index.html`` mit Firefox:

source: By selecting the left drop-down list, the user can see various predefined POST requests, encoded as XML, that can be sent to pycsw:
de: Über die linke Auswahlbox stehen mehrere vordefinierte POST-Requests als XML zur Verfügung. Diese können an pycsw geschickt werden:

source: For example, by selecting "apiso/DescribeRecord", and pushing the "Send" button, a description of the ISO Application Profile record is presented on the right panel:
de: So erscheint beispielsweise durch die Auswahl von "apiso/DescribeRecord" und durch Absenden über den "Send"-Button eine Beschreibung des ISO Application Profile Datensatzes im rechten Bereich:

source: By selecting "GetCapabilities-SOAP" and pushing the "Send" button, a SOAP request is sent to the server to advertise their web service capabilities:
de: Über die Auswahl von "GetCapabilities-SOAP" und durch Absenden über den "Send"-Button wird ein SOAP-Request an den Server geschickt zur Veröffentlichung von deren Web Service Capabilities:

source: Also, the user can search for data records, performing a spatial bounding box query, by selecting "GetRecords-filter-bbox" and editing the coordinates in the XML request:
de: Der Anwender kann außderm nach Datensätzen suchen. Dabei kann eine räumlicher Filter über eine Boundingbox definiert werden, indem "GetRecords-filter-bbox" ausgewählt wird und die Koordinaten im XML-Request angepasst werden:

source: The user can go through all the available requests and perform various requests from this testing application.
de: Der Anwender kann die zahlreichen verfügbaren Anfragen ausprobieren.

source: Capabilities Document and Configuration
de: Capabilities-Dokument und Konfiguration

source: The capabilities of the pycsw installation can be found at ``http://localhost/pycsw?service=CSW&version=2.0.2&request=GetCapabilities``. If you just use ``http://localhost/pycsw`` you will get the capabilities document for CSW 3.0.0, since that is the latest version supported.
de: Das Capabilities der pycsw-Installation findet sich unter ``http://localhost/pycsw?service=CSW&version=2.0.2&request=GetCapabilities``. Wenn Sie lediglich ``http://localhost/pycsw`` aufrufen, erhalten Sie das Capabilities-Dokument für CSW 3.0.0, da dies die aktuellste unterstützte Version ist.

source: To edit the web service metadata, included in the capabilities document, the user can modify the file ``/etc/pycsw/default.cfg`` under the tag ``[metadata:main]``.
de: Um Web Service Metadaten zu bearbeiten, die Teil des Capabilities Dokuments sind, kann der Anwender die Datei ``/etc/pycsw/default.cfg`` unter dem Tag ``[metadata:main]`` bearbeiten.

source: If the user wants to enable INSPIRE Discovery Service support, the metadata under the tag ``[metadata:inspire]`` has to be filled in and the ``enabled`` property has to be set to ``true``.
de: Wenn der Anwender INSPIRE Discovery Service Unterstützung aktivieren möchte, müssen die Metadaten unter dem Tag ``[metadata:inspire]`` gefüllt werden und der ``enabled`` Eintrag muss aktiviert werden.

source: For full functionality and configuration options, please consult the `documentation`_ on the pycsw website.
de: Zur Information über die volle Funktionalität und Konfigurationsmöglichkeiten, schauen Sie bitte in die `Dokumentation`_ auf der pycsw-Webseite.

source: Metadata Creation
de: Erzeugen von Metadaten

source: Metadata files for a spatial dataset or a spatial web service can be created through the open source implementation of inspire directive for metadata, European Open Source Metadata Editor (EUOSME). This application can be found at ``http://inspire-geoportal.ec.europa.eu/editor/``. Source code is available at ``https://joinup.ec.europa.eu/svn/euosme/trunk``
de: Metadaten-Dateien für einen räumlichen Datensatz oder einen räumlichen Web Service können über die Open Source Implementation der Inspire Directive for Metadata, European Open Source Metadata Editor (EUOSME) erzeugt werden. Die Anwendung ist erreichbar unter ``http://inspire-geoportal.ec.europa.eu/editor/``. Der Quellcode findet sich unter: ``https://joinup.ec.europa.eu/svn/euosme/trunk``

source: The user fills the mandatory metadata fields going through the application tabs, adding information like the name of the data owner, keywords, resource location on the web, geographic location (using a bounding box or the name of a country) etc.
de: Der Anwender füllt die Metadaten-Pflichtfelder über die Anwendungsreiter und fügt Informationen wie den Namen des Dateneigentümers, Schlüsselworte, Quelle im Web, räumliche Lage (über eine BoundingBox oder den Ländernamen) etc. hinzu.

source: Loading Metadata
de: Metadaten laden

source: Metadata Repository Setup
de: Metadaten-Repository

source: pycsw supports the following databases:
de: pycsw unterstützt die folgenden Datenbanken:

source: In OSGeoLive, a simple SQLite setup has been implemented. The database can be found in ``/usr/share/pycsw/tests/suites/cite/data/records.db``
de: OSGeoLive nutzt eine einfache SQLite-Datenbank. Diese findet sich unter ``/usr/share/pycsw/tests/suites/cite/data/records.db``

source: Create new database
de: Erzeugen einer neuen Datenbank

source: In order to create a new SQLite database we need to:
de: Um eine neue SQLite-Datenbank zu erzeugen müssen wir:

source: Edit ``/etc/pycsw/default.cfg``:
de: Die Datei ``/etc/pycsw/default.cfg`` bearbeiten:

source: **table**: the table name for metadata records (default is ``records``)
de: **table**: Name der Tabelle für die Metadaten (Standard ist ``records``)

source: Setup the database:
de: Erzeugen der Datenbank:

source: This will create the necessary tables and values for the repository.
de: Dies wird die notwendigen Tabellen und Werte für das Repository anlegen.

source: The database created is an `OGC SFSQL`_ compliant database, and can be used with any implementing software. For example, to use with `OGR`_:
de: Die erzeugte Datenbank folgt dem `OGC SFSQL`_ Standard und kann mit jeder Software, die diesen Standard unterstützt genutzt werden. Zum Beispiel mit `OGR`_:

source: Importing Metadata
de: Import von Metadaten

source: This will import all ``*.xml`` records from ``/path/to/records`` into the new database and configure the repository to expose queryables as per Table 53 of OGC:CSW.
de: Dies wird alle ``*.xml``-Datensätze unter dem Pfad ``/path/to/records`` in die neue Datenbank importieren und konfiguriert das Repository so, dass to expose queryables as per Table 53 of OGC:CSW.

source: Data Discovery through QGIS MetaSearch Plugin
de: Daten entdecken über das QGIS MetaSearch-Plugin

source: Start QGIS from the Desktop GIS group and click on the MetaSearch button (CSW icon)
de: Starten Sie QGIS über die Desktop-GIS-Gruppe im Menü und klicken Sie auf den MetaSearch-Button (CSW-Symbol)

source: Add the pycsw server by pressing the "New" button and type in ``http://localhost/pycsw/``
de: Fügen Sie den pycsw-Server über den "New"-Button hinzu und tragen Sie ``http://localhost/pycsw/`` ein.

source: The user can add some default servers using the "Add default servers" button and also get the capabilities of the server using "Server info" button
de: Der Anwender kann einige Standard-Server über den "Add default servers"-Button bestimmen und kann die Capabilities der Server über den "Server info"-Button erhalten.

source: Perform search using the catalogue, either by a string value or with a bounding box
de: Führen Sie Suchen im Katalog entweder über Begriffe oder über die BoundingBox durch

source: Things to try
de: Was Sie noch ausprobieren können

source: Try to discover data through the Tester application by setting the appropriate requests eg. any text search with the string "imagery" leads to discovering the xml data created previously by EUOSME
de: Entdecken Sie die Daten über die Tester-Anwendung, indem Sie den den entsprechenden Request stellen, d.h. eine Suche mit dem Text "imagery" ermöglicht das Entdecken der xml-Daten, die vorab über EUOSME erzeugt wurden

source: Try to discover data through the Python `OWSLib CSW`_ interface.
de: Versuchen Sie Daten über das Python `OWSLib CSW`_ Interface zu entdecken.

source: Try to discover data from GeoNode, which is also included in OSGeoLive and uses pycsw as the default CSW engine.
de: Versuchen Sie Daten von GeoNode, das ebenfalls auf OSGeoLive vorliegt und das pycsw als den Standard CSW nutzt, zu entdecken..

source: What Next?
de: Was kommt als Nächstes?

source: For more information on pycsw, please consult the `documentation`_ on the pycsw website.
de: Zur Information über die volle Funktionalität und die Konfigurationsmöglichkeiten, schauen Sie bitte in die `Dokumentation`_ auf der pycsw-Webseite.
