Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/rasdaman_quickstart.po
Languages: hu

source: Rasdaman Quickstart
hu: Rasdaman gyorstalpaló

source: Rasdaman is a Big Data Engine for flexible ad-hoc analytics on multi-dimensional spatio-temporal sensor, image, simulation, and statistics data of unlimited size. The Web Coverage Processing Service (WCPS) query language is an Open Geospatial Consortium (OGC) standard wich allows filtering and processing of multi-dimensional raster coverages, such as sensor, simulation, image, and statistics data using web services. The WCPS queries are translated to rasdaman query language, rasql, and are executed on rasdaman. This quick start shows how to access and manipulate an example 2D coverage using WCPS language.
hu: A Rasdaman egy big data motor rugalmas ad-hoc elemzésekhez több dimenziós tér-idő szenzorokhoz, képekhez, szimulációhoz és statisztikai adatokhoz, a méret korlátozása nélkül. A Web Coverage Processing Service (WCPS) lekérdező nyelv egy Open Geospatial Consortium (OGC) szabvány, mely lehetővé teszi több dimenziós raszter fedvények, mint szenzorok, szimuláció, kép és statisztikai adat szűrését és feldolgozását web szolgáltatás használatával. A WCPS lekérdezéseket átfordítjuk rasdaman lekérdezés lenyvre és végrehajtjuk a rasdaman-on. Ez a gyorstalpaló bemutatja hogyan érjünk el és manipuláljunk egy minta 2D fedvényt a WCPS nyelv használatával.

source: Setup
hu: Beállítás

source: The first step before trying any of the following queries is to start rasdaman and Tomcat. Open the *Databases* directory on the Desktop, and then *Start Rasdaman Server*. Allow two to three minutes for rasdaman and especially Tomcat to fully start (once the `rasdaman web client <http://localhost:8080/rasdaman/ows>`_ loads in the browser).
hu: Az első lépés mielőtt a következő lekérdezések bármelyikét kipróbálná a rasdaman és a Tomcat elindítása. Nyissa meg a *Databases* könyvtárat az asztalon és utána *Start Rasdaman Server*. Hagyjon két-három percet a rasdaman-nak és különösen a a Tomcat-nek, hogy teljesen elinduljon (a `rasdaman web kliest <http://localhost:8080/rasdaman/ows>`_ a böngésző betöltse).

source: Afterwards, you can open *Rasdaman-Earthlook Demo* from the same directory, which will launch a local demonstrator in the browser. For a more hands-on tutorial though, continue with the next examples here.
hu: Ezután megnyithatja a *Rasdaman-Earthlook Demo*-t ugyanabból a könyvtárból, mely egy helyi bemutatót indít el a böngészőben. További gyakorlati oktatáshoz folytassa a következő példákkal itt.

source: Running WCPS Queries
hu: WCPS lekérdezések futtatása

source: Either:
hu: Vagy:

source: Go to the `rasdaman web client <http://localhost:8080/rasdaman/ows>`_, switch to the *ProcessCoverages* tab, and enter your query in the query boxes and press send.
hu: Menjen a `rasdaman web kliesnhez <http://localhost:8080/rasdaman/ows>`_, lépjen át a *ProcessCoverages* fülre és gépelje be a lekérdezését a lekérdezés ablakba és nyomja meg a küldést.

source: Add your query in this url: http://localhost:8080/rasdaman/ows?query=your_query and run it using a browser.
hu: Adja hozzá a lekérdezését ehhez az url-hez: http://localhost:8080/rasdaman/ows?query=az_ön_lekérdezése és a böngészőben futtassa.

source: Running Coverage
hu: Fedvény futtatás

source: The example coverage which will be used in the seqeul is a 6 MB image as bellow:
hu: A lekérdezéseben használt példa fedvény az alábbi 6MB-os kép:

source: Access A Coverage
hu: Egy fedvény elérése

source: The WCPS query to access the full coverage is as follows:
hu: A teljes fedvényt elérő WCPS lekérdezés a következő:

source: Click on `coverage request <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c,%20%22png%22%29>`_ to execute it in the browser.
hu: Kattintson a `fedvény lekérdezésre <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c,%20%22png%22%29>`_ a böngészőben végrehajtáshoz.

source: Select a Subset of the Coverage
hu: Fedvény részének kiválasztása

source: The WCPS query to access a subset of the coverage is as follows:
hu: A fedvényt részét elérő WCPS lekérdezés a következő:

source: Click on the `subsetting request <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c[i(0:500), j(0:500)],%20%22png%22%29>`_ to execute it on the browser.
hu: Kattintson a `részhalmaz lekérdezésre <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c[i(0:500), j(0:500)],%20%22png%22%29>`_ a böngészőben végrehajtásához.

source: The query result is an image as follows:
hu: A lekérdezés eredménye a következő kép:

source: Band Extraction from the Coverage
hu: Sáv kivétele a fedvényből

source: The WCPS query to access the red band of the coverage is as follows:
hu: A fedvényt vörös sávját elérő WCPS lekérdezés a következő:

source: Click on `band extraction <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c.red,%20%22png%22%29>`_ to execute it; you should see the following image in the browser as a result:
hu: Kattintson a `sáv kivonatra <http://localhost:8080/rasdaman/ows?query=for%20c%20in%20(NIR)%20return%20encode%28c.red,%20%22png%22%29>`_ a végrehajtásához, a következő képet kell látnia a böngészőben mint az eredmény:

source: Arithmetic Operation: Extracting NDVI of the Coverage
hu: Aritmetikai művelet: NDVI a fedvényből

source: The NDVI (Normalized Difference Vegetation Index) is a measure for the probability of vegetation in remote sensing, i.e., the closer to +1 a pixel is, the more likely it is plants. The WCPS query to derive NDVI from the coverage is as follows:
hu: Az NDVI (normalizált növényzet különbség index) egy mérőszám, a növényzet valószínűségére a távérzékelésben, azaz minél közelebb van a pixel +1-hez, annál valószínűbb, hogy a növényzet. A WCPS lekérdezés az NDVI levezetéséhez a fedvényből a következő:

source: What Next?
hu: Mi következik?

source: The `rasdaman tutorial <http://tutorial.rasdaman.org>`_ provides a condensed introduction to the concepts behind rasdaman, rasql and the OGC web services support.
hu: A `rasdaman oktatóanyag <http://tutorial.rasdaman.org>`_ egy tömör bevezetés a rasdaman hátterében lévő koncepcióhoz, a rasql-hez és az OGC web szolgáltaltás támogatáshoz.

source: Learn more about the OGC `Web Coverage Processing Service <http://www.opengeospatial.org/standards/wcps>`_ (WCPS) Language standard (which was heavily inspired by rasdaman); a good starting point is the `documentation and tutorials page <http://standards.rasdaman.com/>`_ and `WCPS Query SandBox <http://localhost/rasdaman-demo/demo/client/query-sandbox.html>`_.
hu: Tanuljon meg többet az OGC `Web fedvény feldolgozás szolgáltatáról <http://www.opengeospatial.org/standards/wcps>`_ (WCPS) nyelvi szabványról (melyet erősen inspirált a rasdaman); egy jó kezdőpont a `dokumentáció és oktató oldalak <http://standards.rasdaman.com/>`_ és a `WCPS lekérdezés homokozó <http://localhost/rasdaman-demo/demo/client/query-sandbox.html>`_.

source: Interested in coverage data and services in general? Visit OGC's `Coverages Domain Working Group wiki <http://external.opengeospatial.org/twiki_public/CoveragesDWG/WebHome>`_.
hu: Érdeklik a fedvény adatok és szolgáltatások általában? Látogassa meg az OGC `Coverages Domain Working Group wiki-t <http://external.opengeospatial.org/twiki_public/CoveragesDWG/WebHome>`_.

source: Explore the `rasdaman documentation <http://doc.rasdaman.org>`_ to learn about rasdaman administration, its query language, and data ingestion.
hu: Fedezze fel a `rasdaman dokumentációt <http://doc.rasdaman.org>`_ , hogy megismerje a rasdaman adminisztrációt, a lekérdező nyelvet, és az adatbetöltést.

source: Go to the `multi-dimensional demo <http://localhost/rasdaman-demo>`_ to explore interactive 1-D to 4-D rasdaman demos. The small ones are part of OSGeoLive, those utilizing larger sets (beyond this drive's capacity) forward to the `OGC standards showcase site <http://standards.rasdaman.com>`_ .
hu: Menjen a `több dimenziós menüre <http://localhost/rasdaman-demo>`_ az 1-d-től 4-D tartó rasdaman demókhoz. A kisebbek az OSGeoLive részei, azok melyek nagyobb adatokat használnak (a meghajtó kapacitást meghaladót) az `OGC szabványok bemutató oldalra <http://standards.rasdaman.com>`_ tettük fel.
