Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/virtualization_quickstart.po
Languages: fi, pt_br, ru

source: OSGeoLive Quickstart for Running in a Virtual Machine
fi: OSGeoLive pika-aloitus suoritukseen virtuaalikoneessa
pt_br: OSGeoLive Quickstart para Rodar em uma Máquina Virtual
ru: Быстрый запуск OSGeo-Live в виртуальной машине

source: This Quick Start describes one way to run OSGeoLive within a VirtualBox virtual machine. For other methods, follow links from the "See Also" section below.
fi: Tämä pika-aloitus kuvailee yhden tavan suorittaa OSGeolive VirtualBox virtuaalikoneessa. Muita menetelmiä löydät linkeistä "Katso myös" osiosta alhaalla.
pt_br: Este quickstart descreve uma maneira de rodar o OSGeoLive com um máquina virtual do VirtualBox. Para outros métodos veja os links na seção "Veja Também" abaixo.
ru: Это руководство описывает один из способов запуска OSGeo-Live в виртуальной машине VirtualBox. Для остальных способов проследуйте по ссылке из “См. также”.

source: Virtual Machine Advantages
fi: Virtuaalikoneen edut
pt_br: Vantagens da Máquina Virtual
ru: Преимущества виртуальной машины

source: Response speed of a VM is much faster than on the DVD, and typically comparable with installing directly on the host machine.
fi: Vastausajat virtuaalikoneessa ovat paljon nopeampia kuin DVD:n pohjalta ja tyypillisesti verrattavissa suoraan koneeseen asennettuun.
pt_br: A velocidade de resposta de uma máquina virtual é muito mais rápido do que DVD, e tipicamente comparável a se instalar diretamente na máquina.
ru: Скорость работы виртуальной машины зачастую намного быстрее, чем с DVD, а установка практически такая же, как и на хост-машину.

source: All configuration changes, software updates, and saved files are permanent, just like on any "regular" computer. So
fi: Kaikki konfiguraation muutokset, ohjelmiston päivitykset ja talletetut tiedostot ovat pysyviä, juuri aivan kuten missä "tavallisessa" tieokoneessa. Joten
pt_br: Todas as mudanças de configuração, atualizações de programas e arquivos salvos são permanentes, assim como qualquer computador "normal". Então
ru: Все изменения конфигурации, обновления программного обеспечения и сохраненные файлы являются постоянными, как и на любом "обычном" компьютере. Таким образом,

source: You can customize and update the system
fi: Voit räätälöidä ja päivittää järjestelmän
pt_br: Você pode customizar e atualizar o sistema
ru: Вы можете настраивать и обновлять систему

source: You can save your work within the VM
fi: Voit tallentaa työsi virtuaalikoneessa
pt_br: Você pode salvar seu trabalho dentro da máquina virtual
ru: Вы можете сохранить свою работу в виртуальной машине

source: You can install additional software
fi: Voit asentaa lisää sovellutuksia
pt_br: Você pode instalar programas adicionais
ru: Вы можете установить дополнительное программное обеспечение

source: You can backup your virtual machine installation.
fi: Voit varmistaa virtuaalikoneesi asennuksen
pt_br: Você pode realizar o backup da instalação de sua máquina virtual
ru: Вы можете создать резервную копию установки виртуальной машины.

source: System Requirements
fi: Järjestelmävaatimukset
pt_br: Requisitos do Sistema
ru: Системные требования

source: RAM: 2 GB at least. The Lubuntu system runs well with 1 GB of RAM, and you'll need to keep at least the same amount of memory for your host system. So a total of 2 GB will be needed for smooth operation. Some applications, like geoserver, needs that the virtual machine has at least 2GB of RAM. So if possible, consider providing 2 GB or more for your virtual machine.
fi: RAM: 2 GB vähintään. Lubuntu järjestelmä voidaan hyvin suorittaa 1 GB RAM muistissa, ja Sinun tulee varata vähintäin saman verran muistia isäntäjärjestelmälle. Näin ollen tarvitaan yhteensä 2 GB sujuvaan operointiin. Eräät sovellutukset, kute geoserver, tarvitsevat virtuaalikoneelle vähintäin 2GB RAM muistia. Joten jos on mahdollista harkitse varaavasi 2 GB tai enemmän virtuaalikoneellesi.
pt_br: RAM: pelo menos 3 GB. O sistema Lubuntu roda bem com 1 GB de RAM, e você precisar deixar pelo menos a mesma quantidade na máquina que está hospedando a máquina virtual. Então, um total de 2 GB serão necessários para um bom funcionamento. Algumas aplicações, como o geoserver, precisam de máquinas virtuais com pelo menos 2 GB de RAM. Então, se possível, considere fornecer mais de 2 GB para sua máquina virtual.
ru: ОЗУ: 2 Гб и выше. Lubuntu хорошо работает и с 1 Гб оперативной памяти, но вы должны будете оставить примерно такой же объем ОЗУ для хост-системы. Таким образом, для бесперебойной работы потребуются 2 Гб . Некоторым приложениям, например геосерверу, требуется, чтобы виртуальная машина имела не менее 2 Гб ОЗУ. Поэтому, по возможности, выделите минимум 2 Гб для виртуальной машины.

source: Spare Hard Disk Space: The virtual disk file (vmdk) from: `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ unzips to almost 10 GB. And you'll want more space to allow some room to work on the virtual machine. So 20 GB is a good recommendation.
fi: Varaa kovalevylle tilaa: Virtuaalinen levytiedosto (vmdk) sivustolta: `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ purkautuu lähes 10 GB kokoiseksi. Ja lisäksi haluannet lisätilaa virtuaalikoneella työskentelyyn. Joten 20 GB on hyvä suositus.
pt_br: Espaço no HD: O arquivo do disco vitual (vmdk) em: `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ descompactado alcança quase 10 GB. E se você pode querer mais espaço para armazenamento se precisar salvar algum trabalho seu na máquina virtual. Então, 20 GB é uma boa recomendação.
ru: Свободное место на жестком диске: файл виртуального диска (vmdk) с: `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ занимает почти 10 ГБ. А так как вам понадобится больше свободно места для работы в витуальной машине, то рекомендуемый объем свободного места — 20 ГБ.

source: CPU: Any CPU will do, but a processor which supports "Virtualization Technology" will be faster. You can check your computer CPU `here <http://www.intel.com/support/processors/sb/cs-030729.htm>`_.
fi: CPU: Mikä tahansa CPU kelpaa, jos se on prosessori joka tukee "Virtualization Technology" on nopeampi. Voit tarkistaa tietokoneesi CPU:n `täältä <http://www.intel.com/support/processors/sb/cs-030729.htm>`_.
pt_br: CPU: Qualquer CPU irá funcionar, porém um CPU que suporte "Tecnologia de Virtualização" será mais rápido. Você pode chegar seu CPU `aqui <http://www.intel.com/support/processors/sb/cs-030729.htm>`_.
ru: Процессор: любой, однако процессор, поддерживающий “Virtualization Technology”, будет работать быстрее. Вы можете проверить свой процессор `здесь <http://www.intel.com/support/processors/sb/cs-030729.htm>`_.

source: Most machines produced in the last 4-5 years will meet these requirements.
fi: Useimmat koneet jotka on valmistettu 4-5 viime vuoden aikana täyttävät nämä edellytykset.
pt_br: A maioria das máquinas produzidas nos últimos 4-5 anos irão corresponder a estes requesitos.
ru: Большинство компьютеров не старше 4-5 лет соответствуют данным требованиям.

source: Howto
fi: Kuinka teen
ru: Инструкция

source: **Downloads**
fi: **Lataukset**
ru: **Загрузка**

source: Download `Virtual Box <http://www.virtualbox.org/>`_ for your platform, and install the software. On windows run the installer, or on Ubuntu-like linux systems do the following:
fi: Lataa `alustaasi sopiva Virtual Box <http://www.virtualbox.org/>`_ , ja asenna ohjelmisto. Windowsissa suorita asennusohjelma, tai Linux järjestelmässä kuten Ubuntu tee seuraavalla tavalla:
pt_br: Baixe o `Virtual Box <http://www.virtualbox.org/>`_ para sua plataforma e instala o programa. No Windows execute o instalador, ou em sistemas como o Ubuntu execute o seguinte:
ru: Загрузите и установите `Virtual Box <http://www.virtualbox.org/>`_ для вашего типа операционной системы. В Windows запустите Installer. В дистрибутивах Linux на базе Ubuntu выполните следующую команду:

source: In addition download the OSGeo Virtual disk file (vmdk) from `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ . Click on the "Download virtual machine" button. Then unzip the downloaded file (using `7zip <http://www.7-zip.org>`_ ).
fi: Lisäksi lataa OSGeo virtuaali levy tiedosto (vmdk) osoitteesta `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ . Klikkaa "Lataa virtuaali kone" näppäintä. Tämän jälkeen pura ladattu tiedosto (käyttäen `7zip <http://www.7-zip.org>`_ ).
pt_br: Baixe o arquivo do disco virtual (vmdk) do OSGeo em `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ . Clique em "Baixar máquina virtual". Então descompacte o arquivo baixado (usando `7zip <http://www.7-zip.org>`_ ).
ru: Также вы можете скачать OSGeo Virtual disk (vmdk) с `live.osgeo.org <http://live.osgeo.org/en/download.html>`_ . Щёлкните на кнопку “Download virtual machine”. Затем распакуйте загруженный файл (можете использовать `7zip <http://www.7-zip.org>`_ ).

source: **Create a Virtual Machine**
fi: **Luo virtuaalikone**
pt_br: **Criando uma Máquina Virtual**
ru: **Создание виртуальной машины**

source: Start the VirtualBox application and click on the New button to create a new VM, and then Next.
fi: Käynnistä VirtualBox sovellutus ja klikkaa Uusi näppäintä luodaksesi uuden Virtuaalikoneen ja sitten Seuraava.
pt_br: Inicie a aplicação do VirtualBox e clique no botão Novo para criar uma nova máquina virtual, e depois clique em próximo.
ru: Запустите VirtualBox и нажмите на кнопку Создать, затем нажмите Вперёд.

source: Enter a name such as OSGeoLive, and choose Linux as the "Operating system", and Ubuntu as the "Version".
fi: Anna nimi kuten OSGeoLive ja valitse Linux "Operating system" ja Ubuntu "Versioon".
pt_br: Digite um nome, por exemplo OSGeoLive, e escolha Linux como o "Sistema Operacional", e Ubuntu como a "Versão".
ru: Введите имя, например “OSGeo-Live”, выберите операционную систему Linux, версия — Ubuntu.

source: In the next screen set the memory to 1024 MB (or more if your host computer has more than 4GB, like on the screenshot).
fi: Seuraavalla näytöllä aseta muistin kooksi 1024 MB (tai enemmän jos tietokoneessasi on enemmän kuin 4GB, kuten näytönkuvassa).
pt_br: Na próxima tela configura a memória para 1024 MB (ou mais se o seu computador possui mais de 4 GB, como na imagem).
ru: Установите размер основной памяти 1024 MB (или больше, если у вашего компьютера более 4GB ОЗУ, как показано на картинке).

source: Continue to the next screen and choose "Use existing hard disk" . Now click on the button (a folder icon) to browse to where you saved the OSGeoLive vmdk-file. Select this file, press Next and Create.
fi: Jatka seuraavalle näytölle ja valitse "Use existing hard disk". Nyt kllikkaa näppäintä (hakemistoikonia) selataksesi minne tallensit OSGeoLive vmdk tiedoston. Valitse tämä tiedosto. paina Next ja Create.
pt_br: Continue para a próxima tela e escolha "Utiliza HD existente". Agora clique no botão (com o ícone de uma pasta) para navegar até onde você salvou o arquivo vmdk do OSGeoLive. Selecione o arquivo, pressione Próximo e Criar.
ru: Для продолжения нажмите “Вперёд”. Выберите “Использовать существующий жёсткий диск”. Нажмите на кнопку обзора (иконка в виде папки) и укажите путь, куда вы сохранили OSGeoLive vmdk-file. Выберите этот файл, нажмите “Далее”, затем “Создать”.

source: ** Config tips and tweaks**
fi: ** Konfigurointi vinkkejä ja konsteja**
pt_br: **Dicas de Configuração e Melhoramentos**
ru: ** Советы по конфигурации**

source: Once the VM is created, click on the Settings button. In the "General" section, go to the Advanced tab, and click to select "Show at top of screen" for the Mini toolbar.
fi: Kun virtuaalikone on luotu, klikkaa Settings näppäintä. "General" osiossa, siirry Advanced kielekkeeseen ja klikkaa valitaksesi "Show top of screen" Mini työkaluriviä varten.
pt_br: Uma vez que a máquina virtual está criada, clique no botão Configurações. Na seção "Geral", navegue para a aba Avançado, e clique para selecionar "Mostre no topo da tela" para a Mini toolbar.
ru: После того, как виртуальная машина будет создана, нажмите кнопку “Свойства”. В пункте меню “Общие” выберите вкладку “Дополнительно”, и для мини-тулбара отметьте “Расположить сверху экрана”.

source: Go to the "Display" section and increase video memory to 32 or 64 MB. In some host operating systems, it may be required to "Enable 3D Acceleration" for display to work properly.
fi: Siirry "Display" osioon ja lisää videomuistia 32 Mb tai 64 Mb. Joissakin käyttöjärjestelmissä voi olla tarpeen käyttää "Enable 3D Acceleration" näytölle jotta se toimisi kunnolla.

source: In addition, move to the "Shared Folders" section, and click the "Add folder" (green + icon on the right) to find a directory on your host computer that you wish to share inside the VM.
fi: Lisäksi siirry "Shared Folders" osioon ja klikkaa "Add folder" (vihreä + ikoni oikealla) etsiäksesi hakemiston tietokoneeltasi jonka haluat jakaa virtuaalikoneessa.
pt_br: Navegue para a seção "Pastar Compartilhadas", e clique em "Adicionar Pasta" (verde + ícone na direita) para encontrar um diretório no seu computador hospedeiro que você deseja compartilhar com a máquina virtual.
ru: Далее перейдите в пункт меню “Общие папки”, выберите “Добавить папку” (иконка с зеленым “плюсом” на папке справа). Выберите папку на локальной машине, которую вы бы хотели сделать доступной из виртуальной машины.

source: You can select to make the shared folder read only, and auto-mounted. Once the "Folder path" and "Folder name" are defined, click OK, and again OK to finish and close the settings window.
fi: Voit valita haluatko jaetun hakemiston olevan vain luettavissa ja automaattisesti käyttöön otettava. Kun "Folder path" ja "Folder name" on määritetty, klikkaa OK ja uudestaan OK viimeistelyksi ja sulje asetusten ikkuna.
pt_br: Você pode selecionar para criar uma pasta compartilhada como somente leitura e com montagem automática. Uma vez que "o caminho da pasta" e "o nome da pasta" estão definidos, clique em OK, e novamente me OK para terminar e fechar a janela de configurações.
ru: Вы можете выбрать, чтобы общая папка была доступна только для чтения и создавалась автоматически. После того, как будут указаны “Путь к папке” и “Имя папки”, нажмите OK и еще раз OK для того, чтобы закончить настройку параметров и закрыть окно свойств.

source: **Running the Virtual Machine**
fi: **Suoritetaan virtuaalikone**
pt_br: **Rodando a Máquina Virtual**
ru: **Запуск виртуальной машины**

source: Now bootup the VM by clicking the Start (green arrow) button.
fi: Nyt käynnistä virtuaalikone klikkaamalla Start (vihreä nuoli) näppäintä.
pt_br: Para ligar a máquina virtual clique no botão Inicie (seta verde).
ru: Теперь можете запустить виртуальную машину, нажав кнопку “Старт” (с зелёной стрелкой).

source: In the above example, we defined a Shared Folder path on the host system and named it "GIS" in the VM Settings. The shared folder will appear in the file system under /media/sf_GIS/. To mount this folder in the user's home directory, for example, in a terminal do:
fi: Ylläolevassa esimerkissä määrittelimme Jaetun hakemiston polun tietokoneessa ja nimesimme sen "GIS" virtuaalikoneen asetuksissa. Jaettu hakemisto ilmaantuu tiedostojärjestelmässä nimellä /media/sf_GIS/. Tämän hakemiston asentamiseksi käyttäjän kotihakemistoon. esimerkiksi, tee terminaalissa:
pt_br: No exemplo acima, nós definimos o caminho de uma pasta compartilhada no sistema hospedeira e a nomeamos "GIS" nas configurações da máquina virtual. A pasta compartilhada irá aparecer no sistema em /media/sf_GIS/. Para montar a pasta no diretório home do usuário, por exemplo, no terminar execute:
ru: В приведенном выше примере мы определили путь к общей папке в хост-системе и назвали его " ГИС " в настройках виртуальной машины. Общая папка появится в файловой системе в папке /media/sf_GIS/. Чтобы примонтировать её домашней директории пользователя, например, откройте терминал и выполните:

source: Now files on your host machine in the chosen folder will also be available in the VM in the "GIS" folder in user's home directory.
fi: Nyt tiedostot tietokoneessasi valitussa hakemistossa ovat käytettävissä Virtuaalikoneessa "GIS" hakemistossa käyttäjän hakemistossa.
pt_br: Agora os arquivos na sua máquina hospedeira na pasta escolhida, também estarão disponíveis na máquina virtual na pasta "GIS" no diretório home do usuário.
ru: После этого файлы, которые вы поместите в общую папку на локальной машине, будут также доступны в виртуальной машине в папке “GIS” в домашней директории пользователя.

source: See Also:
fi: Katso myös:
pt_br: Veja também:
ru: См. также:

source: OSGeo wiki pages:
fi: OSGeo wiki sivut:
pt_br: OSGeo páginas wiki:
ru: Вики-сайт OSGeo:

source: `Other ways to create a Virtual Machine <http://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
fi: `Muita tapoja luoda virtuaalikone <http://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
pt_br: `Outras formas de criar uma máquina virtual <http://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
ru: `Другие методы создания виртуальной машины <http://wiki.osgeo.org/wiki/Live_GIS_Virtual_Machine>`_
