Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/gdal_overview.po
Languages: pl, ru

source: Geospatial Data Abstraction Library (GDAL/OGR) provides command-line utilities to translate and process a wide range of raster and vector geospatial data formats.
pl: Geospatial Data Abstraction Library (GDAL/OGR) dostarcza narzędzi wiersza poleceń do przeliczania i przekształcania szerokiego spektrum danych przestrzennych zapisanych w formatach rastrowych i wektorowych.
ru: Geospatial Data Abstraction Library (GDAL/OGR) — библиотека абстракции над пространственными данными. Она содержит утилиты командной строки для конвертации и обработки множества форматов растровых и векторных геопространственных данных.

source: The utilities are based upon a cross platform, C++ library, accessible via numerous programming languages. As a library, it presents a single abstract data model to the calling application for all supported formats.
pl: Narzędzia zbudowane są w oparciu o wieloplatformową bibliotekę C++ dostępną z poziomu wielu języków programowania. Biblioteka prezentuje aplikacjom wywołującym ujednolicony model danych dla wszystkich obsługiwanych formatów.
ru: Утилиты основаны на кросплатформенной библиотеке, написанной на C++ и доступной из многих языков программирования. Библиотека предоставляет использующим её приложениям единую для всех поддерживаемых форматов абстрактную модель данных.

source: GDAL/OGR is the most widely used geospatial data access library. It provides the primary data access engine for many applications including MapServer, GRASS, QGIS, and OpenEV. It is also utilized by packages such as OSSIM, Cadcorp SIS, FME, Google Earth, VTP, Thuban, ILWIS, MapGuide and ArcGIS.
pl: GDAL/OGR jest najszerzej stosowaną geoprzestrzenną biblioteką dostępu do danych. Zapewnia narzędzi dostępu do danych wielu aplikacjom, takim jak np.: MapServer, GRASS, QGIS, i OpenEV. Jest również wykorzystywana przez takie programy jak OSSIM, Cadcorp SIS, FME, Google Earth, VTP, Thuban, ILWIS, MapGuide and ArcGIS.
ru: GDAL/OGR — наиболее широко используемая библиотека для доступа к пространственным данным. Она является главным механизмом доступа к данным во многих прикладных программах, включая MapServer, GRASS, QGIS и OpenEV. Её также используют такие пакеты как OSSIM, Cadcorp SIS, FME, Google Earth, VTP, Thuban, ILWIS, MapGuide и ArcGIS.

source: Core Features
pl: Główne funkcje
ru: Основные функции

source: Command-line utilities for data translation, image warping, subsetting, and various other common tasks
pl: Narzędzia wiersza poleceń do przeliczania, odkształcania obrazów, selekcji informacji, i wielu innych częstych zadań
ru: Утилиты командной строки для преобразования данных, трансформации изображений, извлечения подмножеств и многих других типовых задач

source: Highly efficient raster data access, taking advantage of tiling and overviews
pl: Bardzo wydajny dostęp do danych rastrowych, wykorzystujący kaflowanie i podglądy
ru: Высокопроизводительный доступ к растровым данным, использующий преимущества тайловой организации и растровых пирамид

source: Support for large files - larger than 4GB
pl: Obsługa dużych plików - większych niż 4GB
ru: Поддержка больших файлов — свыше 4 Гбайт

source: Library access from Python, Java, C#, Ruby, VB6 and Perl
pl: Dostęp do biblioteki za pomocą języków Python, Java, C#, Ruby, VB6 and Perl
ru: Доступ к библиотеке из Python, Java, C#, Ruby, VB6 и Perl

source: Coordinate system engine built on PROJ.4 and OGC Well Known Text coordinate system descriptions
pl: System obsługi układów odniesienia oparty na bibliotekach PROJ.4 oraz OGC Well Known Text
ru: Механизм поддержки систем координат, основанный на их описаниях в форматах PROJ.4 и OGC Well Known Text

source: Popular Supported Formats
pl: Popularne obsługiwane formaty
ru: Популярные форматы, поддерживаемые библиотекой

source: GDAL supports over 140 raster formats, and OGR over 80 vector formats.
pl: GDAL obsługuje ponad 140 formatów danych rastrowych, OGR ponad 80 wektorowych.
ru: GDAL поддерживает более 140 растровых форматов, а OGR — свыше 80 векторных.

source: These include:
pl: Między innymi są to:
ru: В их число входят:

source: **Raster:** GeoTIFF, Erdas Imagine, SDTS, ESRI Grids, ECW, MrSID, JPEG2000, DTED, NITF, GeoPackage and more ...
pl: **Raster:** GeoTIFF, Erdas Imagine, SDTS, ESRI Grids, ECW, MrSID, JPEG2000, DTED, NITF, GeoPackage i inne ...
ru: **Растровые:** GeoTIFF, Erdas Imagine, SDTS, ESRI Grids, ECW, MrSID, JPEG2000, DTED, NITF, GeoPackage и др.

source: **Vector:** GeoPackage, ESRI Shapefile, GML, GeoJSON, AutoCAD DWG, MapInfo (tab and mid/mif), ESRI Coverages, ESRI Personal Geodatabase, DGN, PostGIS, Oracle Spatial, and more ...
pl: **Wektor:** GeoPackage, ESRI Shapefile, GML, GeoJSON, AutoCAD DWG, MapInfo (tab i mid/mif), ESRI Coverages, Geobaza Osobista ESRI , DGN, PostGIS, Oracle Spatial, i inne ...
ru: **Векторные:** GeoPackage, ESRI Shapefile, GML, GeoJSON, AutoCAD DWG, MapInfo (tab и mid/mif), покрытия ESRI, персональные базы геоданных ESRI, DGN, PostGIS, Oracle Spatial и др.

source: Implemented Standards
pl: Zaimplementowane standardy
ru: Реализованные стандарты

source: The OGR vector data model is compliant with the OGC Simple Features specification.
pl: Model danych OGR jest zgodny ze specyfikacją OGC Simple Feature.
ru: Модель векторных данных OGR соответствует спецификации OGC Simple Features.

source: Details
pl: Szczegóły
ru: Подробности

source: **Website:** http://www.gdal.org
pl: **Strona internetowa:** http://www.gdal.org
ru: **Веб-сайт:** http://www.gdal.org

source: **Licence:** `X/MIT style Open Source license <http://trac.osgeo.org/gdal/wiki/FAQGeneral#WhatlicensedoesGDALOGRuse>`_
pl: **Licencja:** `Otwartoźródłowa licencja typu X/MIT <http://trac.osgeo.org/gdal/wiki/FAQGeneral#WhatlicensedoesGDALOGRuse>`_
ru: **Лицензия:** `открытая лицензия в стиле X/MIT <http://trac.osgeo.org/gdal/wiki/FAQGeneral#WhatlicensedoesGDALOGRuse>`_

source: **Software Version:** |version-gdal|
pl: **Wersja programu:** |version-gdal|
ru: **Версия ПО:** |version-gdal|

source: **Supported Platforms:** Windows, Linux, Mac
pl: *Systemy operacyjne:** GNU/Linux, Mac OSX, MS Windows
ru: **Поддерживаемые платформы:** Windows, Linux, Mac

source: **API Interfaces:** C, C++, Python, Java, C#, Ruby, VB6 and Perl
pl: **Interfejsy API:** C, C++, Python, Java, C#, Ruby, VB6 and Perl
ru: **Интерфейсы API:** C, C++, Python, Java, C#, Ruby, VB6 and Perl

source: **Support:** http://lists.osgeo.org/mailman/listinfo/gdal-dev, http://www.osgeo.org/search_profile
pl: **Wsparcie:** http://lists.osgeo.org/mailman/listinfo/gdal-dev, http://www.osgeo.org/search_profile
ru: **Поддержка:** http://lists.osgeo.org/mailman/listinfo/gdal-dev, http://www.osgeo.org/search_profile

source: Quickstart
pl: Szybkie wprowadzenie
ru: Быстрый старт

source: :doc:`Quickstart documentation <../quickstart/gdal_quickstart>`
pl: :doc:`Przejdź do wprowadzenia <../quickstart/gdal_quickstart>`
ru: :doc:`Документация для быстрого старта <../quickstart/gdal_quickstart>`
