Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/grass_overview.po
Languages: pl

source: Fully featured GIS
pl: Kompletny GIS

source: The Geographic Resources Analysis Support System, commonly referred to as GRASS, is a Geographic Information System (GIS) providing powerful raster, vector, and geospatial processing engines in a single integrated software suite. GRASS GIS includes tools for spatial modeling, visualization of raster and vector data, management and analysis of geospatial data, and the processing of satellite and aerial imagery. It comes with a temporal framework for advanced time series processing and a Python API for rapid geospatial programming. GRASS GIS has been optimized for performance and large geospatial data analysis. It also can produce sophisticated presentation graphics and hardcopy maps. GRASS GIS has been translated into many languages and supports a huge array of data formats.
pl: GRASS (ang. Geographic Resources Analysis Support System) jest Systemem Informacji Geograficznej (GIS) dostarczającym potężnych silników do przetwarzania danych rastrowych, wektorowych oraz przeprowadzania analiz przestrzennych w jednym zintegrowanym pakiecie oprogramowania. System GRASS GIS posiada narzędzia do modelowania przestrzennego, wizualizacji danych rastrowych i wektorowych, zarządzania i analiz danych przestrzennych, przetwarzania obrazów satelitarnych i zdjęć lotniczych. Dostępne jest API Python do zaawansowanego programowania geoprzestrzennego. GRASS GIS został zoptymalizowany do prowadzenia analiz wielkich danych przestrzennych. Pozwala również na tworzenie wyrafinowanych prezentacji graficznych oraz map. GRASS jest przetłumaczony na wiele języków, a także obsługuje wiele formatów danych.

source: GRASS GIS is used around the world in academic and commercial settings as well as by many governmental agencies and environmental consulting companies. It runs on a variety of popular hardware platforms and is Free open-source software released under the terms of the GNU General Public License.
pl: System GRASS jest obecnie używany przez środowiska akademickie i komercyjne na całym świecie oraz przez wiele agencji rządowych i firm, zajmujących się stanem środowiska naturalnego. Pracuje na wielu popularnych systemach operacyjnych. Jest wolnym oprogramowaniem o otwartym kodzie źródłowym wydanym na Powszechnej Publicznej Licencji GNU GPL.

source: The GRASS GIS software includes more than 400 built-in analysis modules. Additionally, over 100 community supplied modules and toolboxes are available for free from the Add-on repository. After more than 30 years of continuous development GRASS GIS is both the longest maintained and largest Open Source GIS available. It is easily scriptable and versatile enough to be used both for batch data processing on massively-parallel supercomputers as well as a handy desktop GIS for handheld PDAs or netbooks.
pl: Składa się z ponad 400 wbudowanych modułów do analiz. Dodatkowo, na stronach wiki dostępnych jest ponad 100 modułów i narzędzi dostarczonych przez społeczność skupioną wokół projektu. Po ponad 30 latach nieprzerwanego rozwoju GRASS jest zarówno najstarszym jak i największym dostępnym Systemem Informacji Geograficznej. Jest łatwo skryptowalny oraz na tyle wszechstronny, aby służyć zarówno do wsadowego przetwarzania danych na super komputerach jak i jako przyjazny GIS desktopowy na palmtopach i netbookach.

source: Core Features
pl: Główne funkcje

source: You name it, there's a `tool for it <https://grass.osgeo.org/grass76/manuals/keywords.html>`_.
pl: Powiedz czego Ci trzeba, na pewno znajdziesz tu odpowiednie narzędzie <https://grass.osgeo.org/grass76/manuals/keywords.html>`_.

source: Explore the `screenshot collection <https://grass.osgeo.org/screenshots/>`_.
pl: Przejrzyj `kolekcję zrzutów ekranu <https://grass.osgeo.org/screenshots/>`_.

source: Details
pl: Szczegóły

source: **Website:** https://grass.osgeo.org
pl: **Strona internetowa:** https://grass.osgeo.org

source: **Licence:** GNU General Public License (GPL) version 2+
pl: **Licencja:** Powszechna Licencja Publiczna GNU (GPL) wersja 2+

source: **Software Version:** |version-grass|
pl: **Wersja programu:** |version-grass|

source: **Supported Platforms:** GNU/Linux, Mac OSX, MS Windows
pl: *Systemy operacyjne:** GNU/Linux, Mac OSX, MS Windows

source: **API Interfaces:** C, Python, Bourne Shell
pl: **Interfejsy API:** C, Python, Bourne Shell

source: **Support:** https://grass.osgeo.org/support/
pl: **Wsparcie:** https://grass.osgeo.org/support/

source: Quickstart
pl: Szybkie wprowadzenie

source: :doc:`Quickstart documentation <../quickstart/grass_quickstart>`
pl: :doc:`Przejdź do wprowadzenia <../quickstart/grass_quickstart>`
