Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/mapserver_overview.po
Languages: it

source: Web Service
it: Servizi Web

source: MapServer is an `Open Source <http://www.opensource.org>`_ geographic data rendering engine written in C. Beyond browsing GIS data, MapServer allows you create "geographic image maps", that is, maps that can direct users to web content. For example, the Minnesota DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ provides users with more than 10,000 web pages, reports and maps via a single application. The same application serves as a "map engine" for other portions of the site, providing spatial context where needed.
it: MapServer è un motore per rappresentazione di dati geografici `Open Source <http://www.opensource.org>`_ scritto in C. Al di la della navigazione di dati GIS, Mapserver permette di create “mappe geografiche”, che possone essere visualizzate dagli utenti attraverso il web. Per esempio, il Minnesota DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ fornisce agli utenti più di 10,000 pagine, report e mappe attraverso una stessa applicazione. La stessa applicazione servea come un “motore di mappe” per altre parti del sito, fornendo contenuti spaziali dove necessari.

source: MapServer was originally developed by the University of Minnesota (UMN) ForNet project in cooperation with NASA, and the Minnesota Department of Natural Resources (MNDNR). Later it was hosted by the TerraSIP project, a NASA sponsored project between the UMN and a consortium of land management interests.
it: MapServer fu originalmente sviluppato dal progetto ForNet dell’Università del Minnesota (UMN) in cooperazione con la NASA, e il Minnesota Department of Natural Resources (MNDNR). Dopo fu mantenuto dal progetto TerraSIP, un progetto sponsorizzato dalla NASA, tra la UMN e una corsorzio di enti interessati alla gestione del territorio.

source: MapServer is now a project of `OSGeo <http://www.osgeo.org>`_, and is maintained by a growing number of developers (nearing 20) from around the world. It is supported by a diverse group of organizations that fund enhancements and maintenance, and administered within OSGeo by the MapServer Project Steering Committee made up of developers and other contributors.
it: MapServer è ora un progetto di `OSGeo <http://www.osgeo.org>`_, ed è mantenuto da un numero crescente di sviluppatori (circa 20) da tutto il monto. È supportato da un gruppo di diverse organizzazione che finanziano miglioramenti e mantenimento, e amministrano con OSGeo il MapServer Project Steering Committee costituito di sviluppatori e altri contributori.

source: Core Features
it: Caratteristiche principali

source: Advanced cartographic output
it: Risultati cartografici avanzati

source: Feature labeling including label collision mediation
it: Etichettature degli elementi includendo mediazione delle collisioni delle etichette

source: TrueType font support for labeling and symbolization
it: Supporto dei font TrueType per etichettatura e simbologia

source: Map element automation (scalebar, reference map, and legend)
it: Elemente della mappa (barra della scala, mappa di referenza, e legenda)

source: Thematic mapping using logical or regular expression-based classes
it: Mappatura tematica usando classi basato su espressioni logiche o regolari

source: Plugable renderer support with drivers for AGG, Cairo and others
it: Supporto per motori di rendering tramite driver AGG, Cairo, GD, OpenGL e altri

source: Special provisioning for tiled output generation
it: Dotazione speciale per la produzione di tile

source: Mask Layers
it: Layer per maschera

source: Precise Symbol Placement
it: Posizionamento preciso dei simboli

source: Complex Multi Label/Symbol Symbology
it: Multi simbologia/etichette complesse

source: Vector Fields
it: Campi vettoriali

source: SVG Symbology
it: Simbologia SVG

source: Multiple Font Support
it: Supporto per font multipli

source: Dynamic Heatmaps
it: Heatmaps dinamiche

source: UTF Grid Support
it: Supporto a UTF Grid

source: Sophisticated spatial query support
it: Supporto a query spaziali sofisticare

source: Identify features by attributes, point, bounding box or geometry across one or more layers
it: Identificare gli elementi attraverso attributi, punti, bounding box o geometria in uno o più layers

source: Support for raster queries
it: Supporto per interrogazioni su raster

source: Fully customizable, template driven output
it: Output completamente personalizzabile tramite template

source: OGR-based query output generation
it: Generazione di output su interrogazioni basate su OGR

source: Support for popular scripting and development environments
it: Supporto per scripting popolari e ambienti di sviluppo

source: PHP, Python, Perl, Ruby, Java, and .NET
it: PHP, Python, Perl, Ruby, Java, e .NET

source: Cross-platform support
it: Support multi piattaforma

source: Linux, Windows, Mac OS X, Solaris, and more
it: Linux, Windows, Mac OS X, Solaris, e altri

source: A multitude of raster and vector data formats
it: Moltissimi formati di dati raster e vettoriali

source: Native support for ESRI shapefiles, PostGIS and Oracle Spatial
it: Supporto nativo per ESRI shapefiles, PostGIS, ESRI ArcSDE and Oracle Spatial

source: Many other formats via GDAL and OGR
it: Molti altri formati tramite GDAL e OGR

source: Map projection support
it: Supporto per le proiezione delle mappe

source: On-the-fly map projection with 1000s of projections through the Proj.4 library
it: Riproiezione di mappe al volo con circa 1000 delle proiezioni attraverso la libreria Proj.4

source: Implemented Standards
it: Standard implementati

source: Support of numerous Open Geospatial Consortium (OGC) standards
it: Supporto di numerosi standard Open Geospatial Consortium (OGC)

source: INSPIRE View Service compliant
it: conforme al INSPIRE View Service

source: Documentation
it: Documentazione

source: `MapServer 7.0 Documentation <../../../mapserver/doc/index.html>`_
it: `Documentazione di MapServer 7.0 <../../../mapserver/doc/index.html>`_

source: Details
it: Dettagli

source: **Website:** http://www.mapserver.org/
it: **Sito web:** http://www.mapserver.org/

source: **Licence:** `MIT-style license <http://mapserver.org/copyright.html#license>`_
it: **Licenza:** `Licenza stile MIT <http://mapserver.org/copyright.html#license>`_

source: **Software Version:** |version-mapserver|
it: **Versione Software:** |version-mapserver|

source: **Supported Platforms:** Windows, Linux, Mac
it: **Piattaforme Supportate:** Windows, Linux, Mac

source: **API Interfaces:** C, PHP, Python, Perl, Ruby, Java, and .NET
it: **Interfacce API:** C, PHP, Python, Perl, Ruby, Java, and .NET

source: **Support:** http://mapserver.org/community/
it: **Supporto:** http://mapserver.org/community/

source: Quickstart
it: Guida rapida

source: :doc:`Quickstart documentation <../quickstart/mapserver_quickstart>`
it: :doc:`Documentazione introduttiva <../quickstart/mapserver_quickstart>`
