Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/ncWMS_overview.po
Languages: it

source: ncWMS publishes multi-dimensional data (such as environmental and weather data) as an OGC compliant Web Map Service (WMS). ncWMS quickly and efficiently extracts the map images from the very large data files typically associated with environmental data.
it: ncWMS pubblica dati multi-dimensionali (tipo dati ambientali e di previsioni meteo) come un Web Map Service (WMS) compatibile con OGC. ncWMS estrae le immagini della mappa velocemente ed efficaciemente da dati molto grandi tipicamente associati con dati ambientali.

source: Core Features
it: Caratteristiche principali

source: Fast extraction of data
it: Estrazione veloce dei dati

source: Generation of timeseries and vertical profile plots
it: Generazione di serie temporali e grafici di profili verticali

source: Ability to plot data along a transect
it: Capacit√† a disegnare dati lungo un transetto

source: Support for a large range of projections (for both source data and target images)
it: Supporto per un vasto range di proiezioni (per entrambi i dati sorgenti e le immagini di riferimento)

source: Support for creating animations
it: Supporto per la creazione di animazioni

source: Browser client included
it: Client per browser incluso

source: Support for export to Google Earth KML format
it: Supporto per esportare nel formato Google Earth KML

source: Input formats: NetCDF, GRIB, OPeNDAP
it: Formati di input: NetCDF, GRIB, OPeNDAP

source: Output formats: PNG, JPEG, animated GIF, KML
it: Formati di output: PNG, JPEG, GIF animati, KML

source: Implemented Standards
it: Standard implementati

source: Details
it: Dettagli

source: **Website:** https://github.com/Reading-eScience-Centre/ncwms
it: **Sito web:** https://github.com/Reading-eScience-Centre/ncwms

source: **Licence:** `Modified BSD License <https://github.com/Reading-eScience-Centre/ncwms/releases/download/ncwms-2.2.8/licence.txt>`_
it: **Licenza:** `Licenza BSD modificata <https://github.com/Reading-eScience-Centre/ncwms/releases/download/ncwms-2.2.8/licence.txt>`_

source: **Software Version:** |version-ncWMS|
it: **Versione del Software:** |version-ncWMS|

source: **Supported Platforms:** All Java 1.8 platforms: Windows, Linux, Mac
it: **Piattaforme Supportate:** tutte le piattaforme con Java 1.8: Windows, Linux, Mac

source: **API Interfaces:** Java; WMS
it: **Interfacce API:** Java, WMS

source: **Support:** https://github.com/Reading-eScience-Centre/ncwms/issues
it: **Supporto:** https://github.com/Reading-eScience-Centre/ncwms/issues

source: Quickstart
it: Guida rapida

source: :doc:`Quickstart documentation <../quickstart/ncWMS_quickstart>`
it: :doc:`Documentazione introduttiva <../quickstart/ncWMS_quickstart>`
