Repository: Chrisganta/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/osm_overview.po
Languages: pl

source: Tools for mapping the world
pl: Narzędzia do kartografii świata

source: Core Features
pl: Główne funkcje

source: A number of editors to choose from
pl: Szeroki wybór edytorów

source: Details
pl: Szczegóły

source: **Website:** https://www.openstreetmap.org
pl: **Strona internetowa:** https://www.openstreetmap.org

source: **Licences:**
pl: **Licencje:**

source: OpenStreetMap data: https://www.openstreetmap.org/copyright
pl: Dane OpenStreetMap: https://www.openstreetmap.org/copyright

source: JOSM: GNU General Public License (GPL) version 2
pl: JOSM: Powszechna Licencja Publiczna GNU (GPL) wersja 2

source: JOSM plugins collection: Ranging from Public Domain to GPLv3
pl: Wtyczki JOSM: Ranging from Public Domain to GPLv3

source: Merkaartor: GNU General Public License (GPL) version 2
pl: Merkaartor: Powszechna Licencja Publiczna GNU (GPL) wersja 2

source: **Software Versions:**
pl: **Wersje oprogramowania:**

source: JOSM: Latest stable snapshot (svn r11427)
pl: JOSM: Ostatni stabilny snapshot (svn r11427)

source: **Supported Platforms:** GNU/Linux, Mac OSX, MS Windows
pl: *Systemy operacyjne:** GNU/Linux, Mac OSX, MS Windows

source: **API Interfaces (data):** REST (via Xapi), XML
pl: **Interfejsy API (dane):** REST (via Xapi), XML

source: **Support:** https://www.openstreetmap.org/help
pl: **Wsparcie:** https://www.openstreetmap.org/help

source: Quickstart
pl: Szybkie wprowadzenie

source: :doc:`Quickstart documentation <../quickstart/osm_quickstart>`
pl: :doc:`Przejdź do wprowadzenia <../quickstart/osm_quickstart>`
